[{"tags":[{"name":"Ceylon"},{"name":"Java"},{"name":"JVM"},{"name":"language"}],"summary":"Ceylon's goals are to be a powerful, readable and predictable programming language as well as a full platform with modularity and tooling. But that´s not enough to describe the language.\n\nCome join us to explore a few of the things that makes Ceylon much more pleasant than Java. Properties, modules, null safety,\nclass cast exceptions, dealing with collections, varargs or generics: we'll show you the many things Java developers will love in Ceylon.","id":3541,"title":"99 Ceylon idioms","track":"JVM Languages","parleysIds":"514892290364bc17fc56c4b6","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/762","speaker":"Stephane Epardaud","speakerId":762},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2034","speaker":"Gavin King","speakerId":2034},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/117","speaker":"Emmanuel Bernard","speakerId":117}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"JPA2"},{"name":"Hibernate"},{"name":"NoSQL"}],"summary":"You like playing with NoSQL database and you’re dreaming of being able to them in your Java EE application. Hibernate OGM is there for you.\nDuring this session, we’ll see how to migrate an application using a relational database to some NoSQL data stores (like EhCache or MongoDB).","id":3140,"title":"A hint of NoSQL into my Java EE","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1125","speaker":"Guillaume Scheibel","speakerId":1125}],"type":"Tools in Action","room":"Room 4"},{"tags":[{"name":"real-time"},{"name":"Hadoop"},{"name":"SoftwareCraftsmanship"},{"name":"big data"}],"summary":"Hadoop opened new possibilities, yet it falls short of instant delivery. Adding stream processing using Nathan Marz’ Storm, can overcome this delay and bridge the gap to real-time aggregation and reporting. \nOn the Batch layer all master data is kept and is immutable. Once the base data is stored a recurring process will index the data. This process reads all master data, parses it and will create new views out of it. The new views will replace all previously created views.\nIn the Speed layer data is stored not yet absorbed in the Batch layer. Hours of data instead of years of data. Once the data is indexed in the Batch layer the data can discarded in the Speed layer. \nThe Query Service merges the data from the Speed and Batch layers. \nThis presentation focuses on the Lambda architecture, which combines multiple technologies to be able to process vast amounts of data, while still being able to react timely and report near real-time statistics.","id":3228,"title":"A real-time architecture using Hadoop & Storm.","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2780","speaker":"Nathan Bijnens","speakerId":2780}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"Hadoop"},{"name":"lingual"},{"name":"cascading"}],"summary":"In my talk, I am going to introduce lingual (http://cascading.org/lingual)  the ANSI SQL framework for apache hadoop and how it relates to cascading (http://cascading.org). I am going to show the basic usage of the catalog, the shell, JDBC support and the dataprovider mechanism, which makes all your data sources available via SQL to be processed on your hadoop cluster.","id":3742,"title":"A whirlwind tour through lingual: ANSI SQL for apache hadoop","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3067","speaker":"André Kelpe","speakerId":3067}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"HTML5"},{"name":"web"},{"name":"AngularJS"},{"name":"javascript"}],"summary":"Learn about building components, testing strategies, and best practices for development of big AngularJS apps.","id":3661,"title":"Advanced AngularJS Workshop","track":"Web & HTML5","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1949","speaker":"Igor Minar","speakerId":1949},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3177","speaker":"Brian Ford","speakerId":3177},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2059","speaker":"Misko Hevery","speakerId":2059}],"type":"Hands-on Labs","room":"BOF 1"},{"tags":[{"name":"Architecture"},{"name":"agile"},{"name":"process"}],"summary":"How are agile development processes related to software architecture and sustainability? Are these disparate concepts? \r\nThis session examines the technical and social causes of the wide-spread problems of structural erosion and the accumulation of technical debt.\r\nIt is illustrated how these problems can be detected and avoided and highlights best practices for the integration of software architecture into agile development processes.","id":3754,"title":"Agile Architecture Management","track":"Methodology","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1504","speaker":"Ingmar Kellner","speakerId":1504}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"Testing"},{"name":"CI"},{"name":"android"}],"summary":"A longer version of the title could be \"Android application development using the techniques, tools and infrastructure of the pro's\".\nThis hands-on lab is intended for people that already started developing Android apps, but that are still a bit unsure about, or a bit deterred by the overwhelming possibilities of testing tools, automated builds, continuous integration...\n\nWe will start together with a ready-made basic application that also talks to a remote server, and we will gradually add concepts like tests (unit tests, mocks, ui testing, ...), automate the build and setup CI.\n\nThis will be a fast-paced session with the intention that you walk away knowing quite well how you could apply all these developments best practices in your Android projects.\nWe will spend 3 hours together reviewing topics like unit tests, instrumentation tests, UI testing, JUnit, Roboelectric, Robotium, Jenkins, UIAutomator, Gradle, Maven, cloud hardware testing services, ...","id":3667,"title":"Android Application Development: Better, Faster, Stronger!","track":"Mobile","parleysIds":"514892290364bc17fc56c481","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/401","speaker":"Filip Maelbrancke","speakerId":401},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/348","speaker":"Peter Kuterna","speakerId":348}],"type":"Hands-on Labs","room":"BOF 1"},{"tags":[{"name":"security"},{"name":"android"},{"name":"mobile"}],"summary":"With more and more functionalities used on our mobile devices, security and privacy become topics of great importance.\nSecurity thus becomes a crucial part of the development process for applications of various categories (including, but not limited to finance, commerce, social…)\n\nThis session aims at giving a concise overview of the design and implementation of a secure Android app.\n\nWe'll start the session with an overview of the Android security architecture. Once the base of the Android security model is explained, we'll dive into securing Android applications from a developers perspective.\n\nWe will discuss:\n- Permissions\n- Component security and secure inter-component interactions\n- Encryption of stored data\n- Secure back-end communication\n- Obfuscation\n- Testing the security of your application\n\nAttendees can walk away from this talk with a solid understanding of Android application security and knowledge about several application-security best practices.","id":3658,"title":"Android Application Security","track":"Arch. & Security","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/401","speaker":"Filip Maelbrancke","speakerId":401},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2903","speaker":"Tegbir Dhillon","speakerId":2903}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"performance"},{"name":"graphics"},{"name":"android"}],"summary":"Join engineers from the Android team at Google as they dive deep into graphics and UI performance topics.\n\nThis session will cover techniques for getting the best performance for your Android applications, as well as case studies in which we will show how to use the tools and information at your disposal to tune and optimize your apps.","id":3190,"title":"Android Performance Workshop","track":"Mobile","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/132","speaker":"Romain Guy","speakerId":132},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/129","speaker":"Chet Haase","speakerId":129}],"type":"University","room":"Room 5"},{"tags":[{"name":"google"},{"name":"AngularJS"},{"name":"javascript"},{"name":"Angular"}],"summary":"Here, we'll cover the most requested topics in building AngularJS applications from the ground up.  From your first code to testing and releasing production code, we'll walk you through the concepts and steps.  We'll also cover the latest features just released in AngularJS 1.2 including Animations, advanced security, touch gestures and more.","id":3764,"title":"AngularJS End to End","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1949","speaker":"Igor Minar","speakerId":1949},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2059","speaker":"Misko Hevery","speakerId":2059}],"type":"University","room":"Room 8"},{"tags":[{"name":"web"},{"name":"AngularJS"},{"name":"javascript"},{"name":"community"}],"summary":"Meet the AngularJS core team at Devoxx and discuss anything and everything related to AngularJS and the future of the web.\r\n\r\nThe format of this session will be an open discussion with some starter topics gathered from the attendees via an online survey before the session.\r\n\r\nPlease submit questions and vote @ http://www.google.com/moderator/#15/e=211938&t=211938.40","id":3655,"title":"AngularJS Meetup @ Devoxx","track":"Web & HTML5","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1949","speaker":"Igor Minar","speakerId":1949},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3177","speaker":"Brian Ford","speakerId":3177},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2059","speaker":"Misko Hevery","speakerId":2059}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"DataStax"},{"name":"apache"},{"name":"Cassandra"}],"summary":"Apache Cassandra is a highly distributed database offering capabilities such as: multi data centre active-everywhere, linear scalability in both volume and throughput, tunable consistency and many more. For these reasons it is currently one of the most popular NoSQL databases. The project recently released Cassandra version 2.0. Datastax will be talking about Cassandra, and some of its latest changes in 2.0.","id":3774,"title":"Apache Cassandra 2.0","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3133","speaker":"Hayato Shimizu","speakerId":3133}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"OpenSourceSoftware"},{"name":"JSR330"},{"name":"Square"},{"name":"android"},{"name":"dependencyinjection"}],"summary":"Dagger is a new, fast dependency injector for Java and Android. Using dependency injection in your app helps promote clean, modular code that also lends itself very well to testing in both automated and manual fashions.\n\nThis talk will start with a basic overview of dependency injection including why you would use it and how Dagger differs from other injectors. Following that we will look at what is necessary to use Dagger in the scope of an Android app. We’ll wrap up with some advanced concepts as well as general tips and tricks for achieving maximum utility.","id":3441,"title":"Architecting Android Applications with Dagger","track":"Mobile","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2065","speaker":"Jake Wharton","speakerId":2065}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"gradle"},{"name":"asciidoc"},{"name":"documentation"},{"name":"Maven"},{"name":"Tools"}],"summary":"Writing documentation is often seen as no fun, but it does not have to be that way! Asciidoc is a member of the microformat markup languages family; like Markdown but with more pizzaz and power. Asciidoctor revolutionizes source doc processing in the JVM by leveraging well-known tools such as Maven and Gradle, you can even call it from the command line as is. Come learn why teams around the world are getting excited about Asciidoctor.","id":3368,"title":"Asciidoctor: because writing docs does not have to suck","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/5","speaker":"Andres Almiray","speakerId":5}],"type":"Quickie","room":"Room 7"},{"tags":[{"name":"Lambda"},{"name":"collections"},{"name":"streamprocessing"}],"summary":"With no doubt, the most widely used API of the JDK is the Collection API. Brilliantly designed 15 years ago, it is still at the core of all the Java applications. In 2004 if underwent its first refactoring with the introduction of the generics. This refactoring did not change the collections patterns. With the introduction of lambda expressions in JDK 8, the collection API is again rewritten, but this time the situation is different : the patterns are completely changed. \r\n\r\nThe first part of this university introduces the lambda expressions, how we can write them, and what they bring to us developers. The second part presents in details the new patterns introduced by the Stream and Collector APIs. These new APIs will change the way we process large collections content, enabling concurrent and parallel access, with a very simple programming model, and amazing patterns. Complex examples will show how powerful those APIs are, and how they can help us write efficient and clean code.","id":3540,"title":"Autumn Collections : from iterable to lambdas, streams and collectors","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2225","speaker":"José Paumard","speakerId":2225}],"type":"University","room":"Room 8"},{"tags":[{"name":"javase"},{"name":"javascript"},{"name":"avatar.js"}],"summary":"This talk is about a new platform for server-side JavaScript applications on the Java Virtual Machine, using the node programming model, apis and module ecosystem. These Java/JavaScript hybrid applications can leverage capabilities of both environments — access the latest node frameworks while taking advantage of the Java platform’s scalability, manageability, tools, and extensive collection of Java libraries and middleware. In this session, you will learn how to write hybrid applications that take advantage of both ecosystems.  One such JavaScript application that allows images to be uploaded to a database from a web client, using a combination of some popular node frameworks and Java APIs will be demonstrated.","id":3759,"title":"Avatar.js, Server-Side JavaScript on the Java Platform","track":"Java EE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1732","speaker":"Jean-françois Denise","speakerId":1732}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"UX"},{"name":"userexperience"},{"name":"android"},{"name":"mobile"},{"name":"Design"}],"summary":"A deep dive on the tools and techniques for building Android applications that follow the Android Design guidelines.  This talk presents patterns and protips for implementing the Holo visual language with it's content first philosophy and responsive design approach.","id":3552,"title":"Awesome Android Design","track":"Mobile","parleysIds":"514892290364bc17fc56c561","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1082","speaker":"Nick Butcher","speakerId":1082}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"batch"},{"name":"ibm"},{"name":"JSR352"}],"summary":"Batch may be the oldest application type in our industry and the most recent to be standardized for Java. Come to this session to learn the essentials of JSR 352: Batch Applications for the Java Platform. Find out the three key concepts every developer should know about. Leave this session equipped with an understanding of when and how to apply the batch application pattern to your business needs.","id":3728,"title":"Batch Applications for the Java Platform (JSR 352)","track":"Java EE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3046","speaker":"Scott Kurz","speakerId":3046}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"javase"},{"name":"openjdk"},{"name":"social"},{"name":"Java8"}],"summary":"With the rise of github and the recent move of the Eclipse foundation to a social coding model, more and more people are wondering why participation in OpenJDK (the open source reference implementation of Java SE)  isn’t keeping up with the times.  A small group of people from the LJC and Adopt OpenJDK are trying to solve this problem by building Betterrev.\n\nBetterrev is a platform that enables social participation in Openjdk, that works by hooking up repositories into Atlassian Bitbucket - ‘Github for mercurial’.  Its goal is reduce barriers to entry and participation in OpenJDK.  Down the line we’re hoping to tie into a build and test platform, so that community contributors can have their patches tested on any system from a macbook air, to an IBM mainframe.","id":3225,"title":"Betterrev: Social Participation in OpenJDK","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2779","speaker":"Daniel Bryant","speakerId":2779},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/405","speaker":"Martijn Verburg","speakerId":405},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1848","speaker":"Richard Warburton","speakerId":1848}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"embeddedjava"},{"name":"Java"},{"name":"JavaFX-multi-touch"},{"name":"sensors"},{"name":"GUI"}],"summary":"A 3-D environment can provide beauty and immersion in a user interface. Unfortunately, it can be really heavyweight for small devices or even the Web, but there are simple techniques that can make your UI unbelievably realistic without the need for 3-D hardware. A technique often used in video games is to use independent layers that are scrolled at different speeds in a simulated parallax motion. This effect provides the illusion of depth, resulting in a rich user experience. If you include touch and screen orientation, the result is a unique and very realistic interface. Attend this session, which includes demos, to learn about the implementation of this unique UI pattern.","id":3292,"title":"Beyond Beauty: JavaFX, Parallax, Touch, Raspberry Pi, Gyroscopes, and Much More","track":"Future<Devoxx>","parleysIds":"516bf3d3e4b05b6ad71fa758","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1928","speaker":"Angela Caicedo","speakerId":1928}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"NoSQL"},{"name":"BigData"},{"name":"cloud"}],"summary":"Informal get together with the Belgian BigData community.","id":3745,"title":"Bigdata.be fireside chat","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/68","speaker":"Steven Noels","speakerId":68},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1774","speaker":"Geert Van landeghem","speakerId":1774}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"DevOps"},{"name":"javaee"},{"name":"MySQL"},{"name":"spring"}],"summary":"We built a full-blown Q&A application in JEE/Spring to exercise all the features of our product. However, what started out as a real-world test case turned into a lot more. By creating an auto-provisioned virtualized environment, everyone in the company can use it as a reference point without going through any tedious setup tasks. Anyone, anywhere, can now start up a predictable environment that behaves exactly the same for everyone else.\n\nIn this case study we'll go through the different aspects of adopting DevOps in the JEE world. We'll introduce Vagrant, Chef and explain how they interact. Finally, we'll demonstrate how it all comes together with a real application and highlight some of the notable uses of this setup inside our company.","id":3183,"title":"Brave New DevOps World: How a Fully Provisioned Environment Helps Everyone","track":"Arch. & Security","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2744","speaker":"Geert Bevin","speakerId":2744}],"type":"Tools in Action","room":"Room 8"},{"tags":[{"name":"video"},{"name":"game"},{"name":"social"},{"name":"iOS"},{"name":"google+"},{"name":"cloud"},{"name":"android"}],"summary":"A toolbox session tuned around the primary needs of mobile game developers; Leverage a Google login to utilize Play game services to handle Achievements and Leaderboards, post gameplay video to YouTube, save and synchronize the state between devices, write interactive posts to the G+ stream, and leverage the power of Analytics to see how effective all of this is.  This session will target developers interested in both Android and iOS development, although there will only be time to complete one path during the lab.","id":3535,"title":"Bringing Google to your Game","track":"Mobile","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2917","speaker":"Daniel Galpin","speakerId":2917}],"type":"Hands-on Labs","room":"BOF 1"},{"tags":[{"name":"security"},{"name":"HTML5"},{"name":"xss"},{"name":"ssl"},{"name":"csp"}],"summary":"The most secure application does nothing at all, which isn't particularly interesting in today's world of web interfaces with functionality we couldn't have dreamed of 2 years ago. We want to create these brilliant experiences, but doing so while ensuring that sensitive user data remains totally secure is a difficult proposition.\n\nHere, we'll explore a few of the fortified bastions that modern browsers make available to us: Content Security Policy (and other interesting HTTP headers), sandboxed iframes, the Web Cryptography API, and MessagePorts give our applications the tools we need to lock down our applications and securely communicate cross-origin.","id":3433,"title":"Browser-side security: Mitigate the risk of XSS","track":"Arch. & Security","parleysIds":"5148922b0364bc17fc56c937","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1797","speaker":"Mike West","speakerId":1797}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"webrtc"},{"name":"websocket"},{"name":"NodeJS"}],"summary":"Learn about the power of the modern web and use WebRTC to build a simple video and text chat app. In this codelab, we'll help you get to grips with the core APIs and technologies of WebRTC: \n- MediaStream (aka getUserMedia): what is it and how can I use it? \n- RTCPeerConnection: what is important about WebRTC’s most powerful API? \n- RTCDataChannel: how can I set up real-time communication of arbitrary data? \n- signalling: what is it and how do I set it up? \n- servers: what do I need for signalling, STUN, and TURN?","id":3428,"title":"Build a WebRTC app","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1084","speaker":"Sam Dutton","speakerId":1084}],"type":"Hands-on Labs","room":"BOF 2"},{"tags":[{"name":"HTML5"},{"name":"Chrome"},{"name":"Native"}],"summary":"Chrome Packaged Apps is a new platform that presents Web developers with a powerful new tool: the ability to create applications with the power and appearance of native apps, but with the safety and security of a web page. Chrome Apps run offline by default, can access the native device hardware, can run on mobile devices, and leverage features not available to traditional Web apps. Come learn how to take your web app to the next level by turning it into a Chrome packaged app.","id":3442,"title":"Build Native Apps with HTML5? With Chrome Apps, You Can","track":"Web & HTML5","parleysIds":"514892290364bc17fc56c4b8","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2782","speaker":"Joe Marini","speakerId":2782}],"type":"University","room":"Room 5"},{"tags":[{"name":"API"},{"name":"cloud"},{"name":"mobile"}],"summary":"Developing APIs can be a huge challenge -- it involves determining a good underlying data model, defining available URL endpoints, handling authentication and authorization, writing client libraries and more.  It *should* be easier.\n\nInternally at Google, we've been working for years to make it easier for our engineers to expose  services as APIs.  What started as a centrally-maintained library for building Google Data APIs became a centrally-maintained service for easily defining + exposing modern JSON-based APIs with simple OAuth2 authorization and auto-generated clients.\n\nThis session will demonstrate how you can define an API for your own service using simple annotations of server-side code and auto-generate mobile (Android, iOS) and web-based clients for your API.  We'll walk through an example end-to-end during the talk.  Uses Google Cloud Endpoints.","id":3623,"title":"Building a REST+RPC API in 30 minutes","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/195","speaker":"Ludovic Champenois","speakerId":195},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2936","speaker":"Ryan Boyd","speakerId":2936}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"BackboneJS"},{"name":"nodegit"},{"name":"javascript"}],"summary":"Learn how to utilize Backbone effectively.  This talk will walk through high level features and inspecting application design concepts.  You will gain knowledge about the library, common workflow, and utilizing Grunt to optimize your project.","id":3758,"title":"Building an Application with Backbone.js","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3109","speaker":"Tim Branyen","speakerId":3109}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"CDI"},{"name":"jboss"},{"name":"javaee6"}],"summary":"You’ve heard about the extensibility of Java EE 6, and heard about CDI (Contexts and Dependency Injection). You may have also looked at Seam 3 or MyFaces CODI. You’ve seen enough to pique your curiosity. This session will sate that curiosity and give you enough information to build great extensions for your application and business.\n\nIn this session, Jason Porter, Senior Software Engineer at Red Hat and Apache DeltaSpike contributor, will cover creating extensions in Java EE 6 and show how using Apache DeltaSpike will ease some of the work.","id":3165,"title":"Building CDI Extensions","track":"Java EE","parleysIds":"514892280364bc17fc56c2d5","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2735","speaker":"Jason Porter","speakerId":2735}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"game"},{"name":"ouya"},{"name":"android"}],"summary":"Ouya, a game console based on Android, broke records during its funding on Kickstarter and rose almost 9 million dollars. The diminuitive console sports a NVIDIA Tegra 3 processor, 1GB of RAM, expandable storage, and 1080p HD output. Unlike other consoles, it has a very low price point(99 USD), the tools to create and distribute games are free. and every game is free to try.\n\nIn this session, we'll learn the basics of game programming and how to package and develop apps and games for the Ouya.","id":3467,"title":"Building Games With Ouya","track":"Future<Devoxx>","parleysIds":"514892290364bc17fc56c475","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/114","speaker":"James Williams","speakerId":114}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"Hadoop"},{"name":"big data"}],"summary":"Hadoop has become very successful over the last few years, but it has grown in size and complexity as the number and variety of components in the ecosystem has increased. How should developers choose which components and APIs to use? How can they be sure their application works across Hadoop component boundaries?\r\n\r\nTo help answer these questions I will first look at some of the common pitfalls in Hadoop application development, then go through some best practices and how to apply them. I will illustrate these best practices with the Cloudera Development Kit (CDK) - a new open source project with the goal of simplifying Hadoop application development.","id":3720,"title":"Building Hadoop Big Data Applications","track":"Cloud & BigData","parleysIds":"514892280364bc17fc56c13e","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/287","speaker":"Tom White","speakerId":287}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"indieDevelopment"},{"name":"podcasting"},{"name":"iOS"},{"name":"premiumPricing"}],"summary":"On his weekly podcast Release Notes, Joe, along with co-host Charles Perry, discusses tips for small independent developers trying to make a living selling mobile applications. One key component is monetization strategy—how you price your apps appropriately, how to take advantage of recurring subscription and In-app Purchase, and how to build a reputation and customer base over time with great products, excellent support, and effective marketing. This session will explore some of those strategies, citing examples from Joe's own company, Bombing Brain Interactive, as well as other independent developers who have found some success selling apps for a premium price.","id":3330,"title":"Business Strategies for Small Independent Developers","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2841","speaker":"Joe Cieplinski","speakerId":2841}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"HTML5"},{"name":"javaee"},{"name":"embeddedjava"}],"summary":"HTML5 has suddenly become a hot item, even in the Java ecosystem. How do the 'old' technologies of HTML, JavaScript, and CSS relate to the Java EE platform and can Java developers really be productive in this new/old world? Java EE specifications such as EJB, CDI, and JPA have standardized the back-end of applications, while the front-end continues to remain unstandardized, with some developers using JSF, while others increasingly use JavaScript.\r\n\r\nWe will explore multiple aspects of application development, while you will learn everything you need to know in this area, and see live demos in NetBeans IDE to illustrate the relevance of HTML5 in the Java world, using simple and intuitive tools that have been especially created for this purpose. Demos will show you how you to create HTML5 front-ends for Java EE 7 back-ends, without any coding at all.","id":3299,"title":"Busy Developer's Guide to Quickly Integrating HTML5 with Java EE 7","track":"Java EE","parleysIds":"514892290364bc17fc56c528","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2291","speaker":"Geertjan Wielenga","speakerId":2291}],"type":"Tools in Action","room":"Room 5"},{"tags":[{"name":"google"},{"name":"PAAS"},{"name":"Java"},{"name":"appengine"},{"name":"cloud"}],"summary":"Five years ago App Engine started offering a PaaS with sandboxing restrictions such as a whitelist of allowed classes, requests timeouts, and a few more constraints. While very powerful for those that could play within this sandbox with auto-scaling, multiple services, versioning and more, others were left cold.\r\n\r\nFeatures such as Backends and TaskQueues lifted some of the restrictions but it’s now time to take App Engine to the next level :\r\n\r\n* Cloud developer? You’ve now been granted Java 7, Maven, continuous integration, web IDE support and a powerful Endpoints API for mobile applications (Android, iOS).\r\n* Feel locked-in? Fear no more with the newly open-sourced App Engine TCK and JBoss CapeDwarf and AppScale implementations.\r\n* Want more granular applications? Meet App Engine Modules!\r\n* Want to run Backends on Compute Engine VMs? Granted!\r\n\r\nCome listen and see for yourself how Google App Engine is reinventing itself, all whilst keeping simplicity and (auto-)scalability as key principles.","id":3707,"title":"Can you hear this? It’s AppEngine’s restrictions imploding one by one","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/195","speaker":"Ludovic Champenois","speakerId":195}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"DevOps"},{"name":"Enterprise"},{"name":"PAAS"}],"summary":"Cloud has come and is here to stay. Do you feel like your IT life is in the stone age? Big companies are slow adapters, but it is not about technology, it's about people.There are many questions to solve. Private or hybrid? Security? Compliance? Come join us to share the experience and key factors for cloud success in an enterprise world.","id":3366,"title":"Cloud in a big enterprise: how to make grassroots movement successful.","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2751","speaker":"Dmitri Guirenko","speakerId":2751}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"patterns"},{"name":"DevOps"},{"name":"cloudbees"},{"name":"cloud"}],"summary":"Cloud \"Platform as a Service\" promise to host your application without a change, but things are not so simple and you can't deploy your legacy EJB 1.0 application to the Cloud without some refactoring. \n\nDuring this session, I will explain some architecture patterns to apply to your new developments, and the possible refactoring or platform services that can help to get your existing application migrated without major changes, so that your transition to the cloud is as smooth as possible.\n\nTo avoid a pure theoretical talk, I'll share experience about migrating devoxx application from traditional hosting to cloud.","id":3106,"title":"Cloud Patterns","track":"Cloud & BigData","parleysIds":"516e9e6ce4b0a97ba5d91c89","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/998","speaker":"Nicolas De loof","speakerId":998}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"scala"},{"name":"FunctionalProgramming"},{"name":"Code-Style"}],"summary":"Scala is an expressive language, but can be hard to grasp when coming from imperative languages.   The key is understanding what expression is in Scala, and how to adapt code to be more expressive.   This talk covers the 'zen' of Scala development, as well as some fundamental approaches to functional programming.   \n\nIn this talk are a series of examples in Java.  First, we'll start translating the Java to leverage more Functional Programming concepts.  Then, we'll step into Scala and watch the boilerplate melt away.\n\nIn particular, the topics covered are:\n* Expression oriented programming, the basics of FP\n* Simplicity in Design\n* Abstracting behaviors\n* How Functional and OO programming blend\n* Asynchronous programming with Futures and Promises\n* Removing edges in libraries with implicit classes and value classes\n* Tracking lexical state with implicit values.","id":3399,"title":"Coding in Style:  How to wield Scala in the trenches","track":"JVM Languages","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1858","speaker":"Joshua Suereth","speakerId":1858}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"Monitoring"},{"name":"DevOps"},{"name":"cloud"}],"summary":"We manage our sourcecode in the cloud (GitHub), build in the cloud (Travis CI) and run in the cloud (AWS). But what about monitoring?\n\nDo you still use Nagios? Or don't you know because this is\"operations stuff\"? You should care because we are living in a DevOps world.\n\nDuring the last years a plenty of Monitoring-as-a-Service (MaaS) providers have popped up. This session takes a look at the top MaaS providers and compares their feature sets.","id":3287,"title":"Comparing Monitoring-as-a-Service Providers","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2819","speaker":"Oliver Geisser","speakerId":2819}],"type":"Quickie","room":"Room 9"},{"tags":[{"name":"continuousdelivery"},{"name":"anti-patterns"},{"name":"agile"}],"summary":"Releasing and Risk start with an R for a reason. Continuous delivery is the buzzed killer for that.. or is it? We'd like to take you to a journey through well-practiced malpractice, discussing some of the most interesting hoops people made people jump through.\n\nWhile releasing and doing infrastructure in organisations big and small, ranging from (soon to be multi-million) startups to multi-million corporations, we’ve learned that good intentions, backed by poor execution and lack of thinking ahead, can lead to hell on earth. Growing platforms is tough enough by itself, let’s not make it harder with insane release processes...\n\nWell, continuous delivery is a people thing. Let us share our experiences.","id":3500,"title":"Continuous Delivery antipatterns","track":"Methodology","parleysIds":"514892290364bc17fc56c4bc","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/903","speaker":"Andrzej Grzesik","speakerId":903}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"patterns"},{"name":"Methodology"},{"name":"continuousdelivery"}],"summary":"Have you ever scaled a team from 2 developers to 200? How about 2000 and more? If you’ve done this, you quickly realize that builds and build automation are a big challenge for the organization that needs to scale up. \n\nDuring this talk, Hans Dockter will look at common patterns for building larger software stacks and discuss their advantages and disadvantages. He will also present a new pattern that scales even with very large software stacks. It allows you to integrate as early as possible but at the same time keep the delivery pipeline for new features flowing. This is a critical problem for many teams. Hans will share many stories of real life projects, how they were affected by a dysfunctional pipeline and what it took to improve their situation. This talk will also cover in detail the importance of a single enterprise component graph across builds and the challenges of how to promote components that belong to one releasable unit.","id":3604,"title":"Continuous Delivery Patterns for Large Software Stacks","track":"Methodology","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/958","speaker":"Hans Dockter","speakerId":958}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"javase"},{"name":"NAO"},{"name":"robotics"}],"summary":"NAO is a state-of-the-art humanoid robot with 25 degrees of freedom.\r\nWith a brand-new SDK allowing easier integration, you'll discover how simple it is to use Java to control NAO robot and create apps.","id":3760,"title":"Controlling the humanoid NAO Robot with Java","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2083","speaker":"Dimitri Merejkowsky","speakerId":2083}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"event-sourcing"},{"name":"CQRS"},{"name":"DDD"}],"summary":"The CQRS (Command-Query Responsibility Segregation) pattern is a thought provoking way to look at the architecture of modern application systems and provides a way to put an end to some established and rarely challenged assumptions that have been guiding our architectural decisions for decades. In this session, I'm going to introduce the basic idea behind CQRS and demonstrate how the pattern can be applied to applications as a sequence of smaller steps. I'll end up with an Event Sourcing architecture and close the session with some guidelines on when and where to apply the pattern.","id":3199,"title":"CQRS for Great Good","track":"Arch. & Security","parleysIds":"5148922a0364bc17fc56c73c","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/834","speaker":"Oliver Wolf","speakerId":834}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"HTML5"},{"name":"Hadoop"},{"name":"RaspberryPI"},{"name":"websockets"},{"name":"NodeJS"}],"summary":"Learn how the Devoxx team has enhanced the NFC voting and has added favouriting to the mix using Raspberry PI's.  In addition we've started an experiment for crowd tracking using PI's and PiWi's.","id":3721,"title":"Crowd tracking and NFC voting with Raspberry PI","track":"Future<Devoxx>","parleysIds":"5148922b0364bc17fc56c928","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/70","speaker":"Stijn Van den enden","speakerId":70},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1852","speaker":"Hans Cappelle","speakerId":1852},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/745","speaker":"Tim Peeters","speakerId":745},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/11","speaker":"Gert Leenders","speakerId":11},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1","speaker":"Jo Voordeckers","speakerId":1}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"security"},{"name":"W3C"},{"name":"web"},{"name":"javascript"}],"summary":"Many operations you like to perform on the web like authentication, sending secure messages and the signing of documents require cryptographic operations. W3C started an effort to standardise a secure API for performing these operations on the web. This work resulted in a Javascript Web Cryptography API which will be implemented by all major browsers soon, but is also applicable in other environments.\n\n\nThis talk will start by quickly explaining why a native Cryptography API is required, followed by an introduction to the Web Cryptography API by exploring some of its use cases using live code demos in various browsers.","id":3310,"title":"Cryptographic operations in the browser","track":"Arch. & Security","parleysIds":"5167d585e4b07b9cc6de325d","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2807","speaker":"Nick Van den bleeken","speakerId":2807}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"dartlang"},{"name":"google"},{"name":"dart"}],"summary":"The Dart team and co-founders answer your questions, big and small. Hear what Dart, Google's new web programming platform that compiles to JavaScript, is all about, straight from the source. Bonus: we'll play buzzword bingo. Grab a card, listen for panelists to mention words like \"optional types\" or \"batteries\" (you'll see), and win a prize.\r\n\r\n* Lars Bak\r\n* Kasper Lund\r\n* Dan Grove\r\n* Florian Loitsch\r\n* Steve Messick\r\n* Søren Gjesse\r\n* Seth Ladd (moderator)","id":3766,"title":"Dart Team - Ask Us Anything + Buzzword Bingo! (Part 1/2)","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1775","speaker":"Seth Ladd","speakerId":1775},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3040","speaker":"Lars Bak","speakerId":3040}],"type":"Quickie","room":"Room 6"},{"tags":[{"name":"dartlang"},{"name":"google"},{"name":"dart"}],"summary":"The Dart team and co-founders answer your questions, big and small. Hear what Dart, Google's new web programming platform that compiles to JavaScript, is all about, straight from the source. Bonus: we'll play buzzword bingo. Grab a card, listen for panelists to mention words like \"optional types\" or \"batteries\" (you'll see), and win a prize.\r\n\r\n* Lars Bak\r\n* Kasper Lund\r\n* Dan Grove\r\n* Florian Loitsch\r\n* Steve Messick\r\n* Søren Gjesse\r\n* Seth Ladd (moderator)","id":3767,"title":"Dart Team - Ask Us Anything + Buzzword Bingo! (Part 2/2)","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1775","speaker":"Seth Ladd","speakerId":1775},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3040","speaker":"Lars Bak","speakerId":3040}],"type":"Quickie","room":"Room 6"},{"tags":[{"name":"NoSQL"},{"name":"BigData"},{"name":"Architecture"}],"summary":"For years we have all been dealing with persisting state in our beloved RDBMSes. As a result of this, well-known & accepted patterns for dealing with persistent data have emerged. Patterns we've all been happily applying. But as we've moved into the cloud era of computing and data volumes that keep on getting bigger, new storage paradigms have emerged. We don't necessarily have to store our data in these relational tables anymore. So what storage types do suit these new use cases? And how should we best store and access that data?\nIn this presentation, we'll review the nature of these data storage types. Using examples, show how their access patterns are vastly different. And, finally, try to present concrete solutions on dealing with some of them. Some solutions are straight forward and simple enough that you can apply them in your existing apps today. While others require you to rethink how you go about solving problems when dealing with huge amounts of data.","id":3364,"title":"Data Access Patterns in this day and age (of cloud, bigdata, nosql & other buzzwords)","track":"Cloud & BigData","parleysIds":"514892280364bc17fc56c1b8","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/403","speaker":"Alex Snaps","speakerId":403}],"type":"University","room":"Room 9"},{"tags":[{"name":"REST"},{"name":"spring-XD"},{"name":"spring"}],"summary":"As data-driven applications become more widespread, the services that provide the data are becoming more critical. Most commonly these data services are exposed via REST-ful APIs. This session describes what exactly makes a service REST-ful, how to implement a REST-ful API using Spring, and how to test that API.\r\n\r\nIn addition, the implementation of this API was done with many of the new features in Spring Framework 4.0 and are a good demonstration of the power it provides.","id":3763,"title":"Designing a REST-ful API using Spring 4","track":"Java EE","parleysIds":"5148922b0364bc17fc56c8bd","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2152","speaker":"Ben Hale","speakerId":2152}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"HTML5"},{"name":"Glassfish"},{"name":"javaee"},{"name":"javaee7"}],"summary":"As usual IntelliJ IDEA keeps up with cutting-edge technologies to provide latest productivity-enhancing tools for Web and enterprise development right out of the box. The release of IntelliJ IDEA 13, planned in December, embraces the latest additions to Java EE stack, including JSF 2.2, JAX-RS 2.0, CDI 1.1, Glassfish 4, HTML 5, and many more. This presentation will showcase the new and improved features that always have a trick up their sleeve to help developers out of even most complicated cases and to be even more productive.","id":3306,"title":"Developer Tools for Java EE 7 and HTML 5 in IntelliJ IDEA 13","track":"Java EE","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2738","speaker":"Andrey Cheptsov","speakerId":2738}],"type":"Tools in Action","room":"Room 5"},{"tags":[{"name":"Devoxx"},{"name":"parleys"},{"name":"devoxx4kids"}],"summary":"During this welcome keynote you can expect a status update on Devoxx and Parleys some practical info and several related announcements.","id":3768,"title":"Devoxx Welcome and Announcements","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2","speaker":"Stephan Janssen","speakerId":2}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"NAO"},{"name":"D4K"},{"name":"devoxx4kids"}],"summary":"Do you want to organise your own Devoxx4Kids event?  Then attend this session where the Devoxx4Kids organisers from Belgium and Netherlands will share their best practices.  In addition you'll also learn which software, hardware and robots work best with teenagers.","id":3778,"title":"Devoxx4Kids Best Practices","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1750","speaker":"Daniel De luca","speakerId":1750},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/219","speaker":"Regina Ten bruggencate","speakerId":219},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/284","speaker":"Roy Van rijn","speakerId":284}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"HTML5"},{"name":"asciidoc"},{"name":"CSS3"},{"name":"documentation"},{"name":"PDF"}],"summary":"Writing e-mail is easy. We do it all the time. Writing documentation, on the other hand, is hard. We practically have to force ourselves to do it. Of the two, documentation has a much greater impact on our success and the success of our projects.\n\nWhy, then, do we make it more difficult by burying the content in XML or struggling with finicky WSYWIG editors? \n\nWhat if you could write documentation just as you write email? Forget about the layout and styling and just let the thoughts flow? That's the idea behind lightweight markup languages such as AsciiDoc. They provide a plain text syntax designed for humans--easy to edit, read, version and share in raw form.\n\nAsciiDoc goes further by satisfying even the most advanced  technical semantics and publishing requirements. AsciiDoc is a capable shorthand alternative to DocBook and can produce beautiful HTML 5, ePub and PDF output--even slides!\n\nFollow the lead of authors. Drop the angled bracket and discover the zen of writing in AsciiDoc!","id":3557,"title":"Discover The Zen Of Writing (Ascii)Docs","track":"Web & HTML5","parleysIds":"514892290364bc17fc56c4c4","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/244","speaker":"Dan Allen","speakerId":244}],"type":"Tools in Action","room":"Room 8"},{"tags":[{"name":"mindtrick"},{"name":"Methodology"},{"name":"fun"},{"name":"agile"},{"name":"inspirational"}],"summary":"Never sit in the comfort zone. We all know this saying, yet we still tend to stay on known terrains. We usually think about this applied only to programming. While, of course, it does - so if you've seen functional / object oriented... try Prolog (!). If you've never programmed functional, dive right into Standard ML, or... implement a pet language! It's not about \"will I use this\", it's about the road and enlightenment which comes out during the most unexpected moments. I'd even say more, we can and maybe should apply this rule to other things in live - in order to grow as a person. Never lived abroad, still young, try it out! \"What's those kanji things anyway?\" - learn some! by this talk I hope to motivate you to live interesting lives, so we have awesome stories to laugh about in the future if we meet again :-)","id":3699,"title":"Disrupt 2 Grow","track":"Methodology","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2054","speaker":"Konrad Malawski","speakerId":2054}],"type":"Quickie","room":"Room 3"},{"tags":[{"name":"javase"},{"name":"caching"},{"name":"Hazelcast"}],"summary":"Today’s applications are getting more and more distributed everyday and it is well-known that distributed programming is hard. With Hazelcast though, distributed programming is easy and lots of fun. A common reaction of Hazelcast users is ‘Ooh my God, this cannot be that easy’. Hazelcast is an open source, highly scalable, transactional, distributed/partitioned implementation of queue, map, set, list, lock and executor services for Java. Hazelcast is for you if you like to easily: share data/state among many servers (e.g. web session sharing), cache your data (distributed cache), cluster your application, partition your in-memory data, send/receive messages among applications, distribute workload onto many servers, take advantage of parallel processing or provide fail-safe data management","id":3777,"title":"Distributed Systems using Hazelcast","track":"Java EE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3250","speaker":"Peter Veentjer","speakerId":3250}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"Methodology"},{"name":"Git"},{"name":"SVN"}],"summary":"Are you using Subversion or CVS? That's great, whatever you do, don't migrate to Git! Git makes you work overtime, confuses developers with too many options, destroys the social interaction with your co-workers and much more. Git has unnecessary features like offline commits and cherry picking that nobody needs at his day job. Your code is the most important thing for your software development and you should use a mature technology for storing it. Let the kids play around with Git.\nIn this ironic lightning talk I will give you 5 reasons, why you shouldn't use Git always with a twinkle in the eye. So create a new branch in SVN and come to my session while you checkout the branch.","id":3144,"title":"Don't use Git","track":"Methodology","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/841","speaker":"Sven Peters","speakerId":841}],"type":"Quickie","room":"Room 5"},{"tags":[{"name":"scala"},{"name":"Java"},{"name":"Architecture"},{"name":"Akka"},{"name":"Concurrency"}],"summary":"In this presentation I will explore some of the Akka design patterns that are emerging in the Akka community and best practices for solving typical problems you will encounter when building scalable and robust systems with Akka actors. \r\n\r\nThis session I will show, how to implement distributed workers, blocking resources, prevent cascading failures and others.","id":3612,"title":"Effective Akka design patterns","track":"Arch. & Security","parleysIds":"514892290364bc17fc56c516","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2873","speaker":"Ryan Knight","speakerId":2873}],"type":"Tools in Action","room":"Room 4"},{"tags":[{"name":"IDE"},{"name":"Jetbrains"},{"name":"IDEA"}],"summary":"IntelliJ IDEA is an award-winning integrated development environment (IDE) for Java and other languages, developed by JetBrains.\r\nIDEs, like any other tools, need to be mastered to achieve maximum efficiency.\r\nUnfortunately, many users of IntelliJ IDEA are familiar with only a small portion of its features.\r\nIn this presentation I will show some of the best ways to write actual code in IntelliJ IDEA.\r\nI will demonstrate how to quickly spot and fix problems in code using the IDE, and how to safely refactor your code.\r\nI will also reveal some hidden features of IntelliJ IDEA and tell you how to find useful features which you haven't discovered yet.","id":3772,"title":"Efficient coding in IntelliJ IDEA","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3122","speaker":"Nikolay Chashnikov","speakerId":3122}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"graphics"},{"name":"android"},{"name":"mobile"},{"name":"Native"},{"name":"opengl"}],"summary":"Image processing is one of the most computationally expensive task on a mobile device -- it's also a very popular one, as more and more users want the ability to create engaging content straight out of their phone or tablet. More so than other platforms, mobile processing need to take in account various constraints such as battery life, memory usage, cohabitation with the system and other applications, and the need to work on widely different architectures.\r\nThis session will focus on some of the technologies available on Android to achieve those goals, in particular Renderscript, native code and OpenGL. The architecture of the Android 4.3 photo editor will be used as a backdrop, describing a dynamic processing pipeline implementing non-destructive editing and full-size image processing.","id":3722,"title":"Efficient Image processing on Android","track":"Mobile","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1576","speaker":"Nicolas Roard","speakerId":1576}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"javaee7"},{"name":"EJB3.2"},{"name":"EJB3"}],"summary":"This session covers the latest advancements with the Enterprise JavaBeans (EJB) specification.  Focused on what is new in EJB 3.2, this session also explores where EJB has come and where it is going in future.  Demos include a hands-on introduction to the misleadingly-named \"MDB\" API and latest changes that allow them to be connected to any system, not just JMS.  Learn what possibilities this unlocks and how it can be leveraged in any enterprise or cloud environment to create interfaces into systems that go beyond HTTP or JMS.","id":3746,"title":"EJB 3.2 and Beyond","track":"Java EE","parleysIds":"5148922b0364bc17fc56c92d","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2061","speaker":"David Blevins","speakerId":2061}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"scala"},{"name":"Testing"},{"name":"Amazon"},{"name":"Akka"}],"summary":"Amazon SQS is great if you need a simple message queueing system. Though when using SQS, it would be good to test how our code integrates with it (for example if it correctly handles the visibility timeout or queue creation parameters). Thus ElasticMQ was created: to provide an embeddable, in-memory SQS implementation.\n\nIn the talk I will show how easy it is to run an embedded or stand-alone ElasticMQ server and test SQS client code, both from JVM-based and non-JVM languages. \n\nThe second part will be more technical; I will briefly explain how actors are used to handle queues, how to implement long polling using futures, and how to write sequential-like code which in fact runs asynchronously using Akka Dataflow. I will also demo some of the features of Spray, an Akka-based HTTP/REST toolkit, which make it easy to quickly create APIs.\n\nThe project is fully open-source. You are encouraged to fork at: https://github.com/adamw/elasticmq.","id":3127,"title":"ElasticMQ: a fully asynchronous, Akka-based Amazon SQS server","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/95","speaker":"Adam Warski","speakerId":95}],"type":"Quickie","room":"Room 9"},{"tags":[{"name":"scalable"},{"name":"couchbase"},{"name":"search"},{"name":"analysis"},{"name":"NoSQL"},{"name":"big data"},{"name":"elasticsearch"}],"summary":"During this \"live coding\" talk, Tugdual and David will move an old-fashion full SQL application to the NoSQL world.\n\nUsing CouchBase and Elasticsearch, they will show all gains you can have with this new architecture:\n- Easyness\n- Elasticity (scalablity)\n\nFollowing points will be covered:\n- Document Oriented Model\n- JSon\n- REST\n- Caching / Memcache\n- Full text search\n- Building live dashboards with Kibana","id":3281,"title":"Elastify your app: from SQL to NoSQL in less than one hour!","track":"Cloud & BigData","parleysIds":"514892280364bc17fc56c070","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1505","speaker":"Tugdual Grall","speakerId":1505},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1409","speaker":"David Pilato","speakerId":1409}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"jsr236"},{"name":"javaee7"},{"name":"Concurrency"}],"summary":"Concurrent programming has always been a topic in Java. But handling multiple threads by yourself can bring you into serious issues. In Java SE 5 the Executor Framework and java.util.concurrent came to the rescue. Unfortunately not for Java EE developers. They always had to find an application server specific way of dealing with tread pools.\n\nUp until now as Java EE7 introduces JSR236: Concurrency Utilities for Java EE\n\nThis session will introduce the attendees to the benefits and gotchas of concurrent programming in Java and Java EE application servers by showing different real life scenarios. Learning out of the mistakes of the past we will rewrite our code to use the ManagedExecutors of JSR236 in GlassFish 4.0. By combining it with other Java EE7 APIs like AsyncServlet of Servlet 3.1 and JAX-RS 2.0 the attendees will get an idea how to easily attack those real life scenarios with the help of Java EE 7.","id":3686,"title":"Enterprise Concurrency - practical solutions with JSR236","track":"Java EE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2846","speaker":"Alex Heusingfeld","speakerId":2846}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"patterns"},{"name":"cloud"},{"name":"Design"}],"summary":"Especially scale-out systems, but also more traditional, highly available systems need a fault tolerant application design, because the standard fault tolerance mechanisms on infrastructure level are either not available or not sufficient and therefore must be implemented on application level. On the other hand fault tolerance is known as an extremely complicated and challenging domain. So, time to panic?\n\nNo, not at all! Even though fault tolerant application design is not a trivial domain but there are a lot of patterns which will give a lot of value while being implemented surprisingly easy. In this session, you will learn some of these patterns and how to implement them based on real-life code examples.\n\nThose patterns are always extremely useful, also outside the domain of scale-out applications. Yet, very often they do not become implemented, simply because no one knowns how easy it is. After this session you will know better!","id":3172,"title":"Fault tolerance made easy","track":"Arch. & Security","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2741","speaker":"Uwe Friedrichsen","speakerId":2741}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"graphics"},{"name":"animations"},{"name":"android"}],"summary":"Android provides many APIs and capabilities to liven up dull UIs through graphical effects and animations. Come to this session to learn various techniques for making your mobile clients not just rich, but filthy rich.","id":3192,"title":"Filthy Rich [Android] Clients","track":"Mobile","parleysIds":"514892260364bc17fc56bd47","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/132","speaker":"Romain Guy","speakerId":132},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/129","speaker":"Chet Haase","speakerId":129}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"Testing"},{"name":"Java"},{"name":"Selenium"}],"summary":"Would you like to automate your acceptance tests against multiple browsers and multiple servers ? Having your UI tests run faster ? And remove the boilerplate on them ? Ask browser automation tools to the rescue ! You will see in this session how you can gain plenty of time using it. We will see the basics concepts of FluentLenium, a java wrapper around the Selenium API.","id":3455,"title":"First steps with FluentLenium, efficient UI testing in Java","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1393","speaker":"Mathilde Lemee","speakerId":1393}],"type":"Quickie","room":"Room 7"},{"tags":[{"name":"Testing"},{"name":"Java"},{"name":"Selenium"}],"summary":"Would you like to automate your acceptance tests against multiple browsers and multiple servers ? Having your UI tests run faster ? And remove the boilerplate on them ? Ask browser automation tools to the rescue ! You will see in this session how you can gain plenty of time using it. We will see basics and advanced concepts of FluentLenium, a java wrapper around the Selenium API.","id":3453,"title":"FluentLenium, UI testing with less boilerplate","track":"Java SE","parleysIds":"516e9ea7e4b0a97ba5d91c8a","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1393","speaker":"Mathilde Lemee","speakerId":1393}],"type":"Tools in Action","room":"Room 4"},{"tags":[{"name":"OpenSourceSoftware"},{"name":"databasemigration"},{"name":"database"},{"name":"Java"},{"name":"continuousdelivery"},{"name":"sql"}],"summary":"Database schema evolution is often performed ad-hoc: a quick statement here, a little script there. The result: confusion and uncertainty. Has this update already been applied on this instance? Should we apply this other script first? Is our application going to run against this database?\n\nNo more! This is where database migration tools come to the rescue! We'll look at a popular open-source choice called Flyway. By the end of the session, you'll have a solid understanding of what it does, how it works and how to effectively integrate it into your project.","id":3516,"title":"Flyway: The agile database migration framework for Java","track":"Java EE","parleysIds":"514892280364bc17fc56c273","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/108","speaker":"Axel Fontaine","speakerId":108}],"type":"Tools in Action","room":"Room 5"},{"tags":[{"name":"Testing"},{"name":"refactoring"},{"name":"cloud"},{"name":"Livecoding"}],"summary":"Developing new apps from scratch for the cloud is getting easier and easier. But what about with existing code? Can techniques well suited to brand-spanking-new projects still work with \"Legacy\" code? \n\nThis fast-paced, live coding session will show that we can take a small application with unreadable  code, clean it up, and add new features to attain continuous deployment to the Cloud. And all in under an hour!\n\nCome and discover strategies and practices such as refactoring, test-driven development, and continuous testing.\n\nIf this all sounds too easy, each step of the process must be extremely simple as possible and feedback loops incredibly short!","id":3108,"title":"From Legacy to Cloud in Under an Hour - Live Coding","track":"Methodology","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1382","speaker":"David Gageot","speakerId":1382}],"type":"Tools in Action","room":"Room 8"},{"tags":[{"name":"Lambda"},{"name":"FunctionalProgramming"},{"name":"groovy"}],"summary":"In recent years functional programming has gained ground over object oriented mainly due to the advancement in computing power. The JVM is no exception, you can find powerful contenders in Clojure and Scala. However Groovy doesn't stay behind. The Groovy programming language contains a wide array of APIs and features that facilitate a functional programming style, such as closure composition, memoization, trampolines, iterator methods and more. We'll explore all of these features that are sure to spice up your daily experience.","id":3367,"title":"Functional Groovy","track":"JVM Languages","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/5","speaker":"Andres Almiray","speakerId":5}],"type":"Quickie","room":"Room 7"},{"tags":[{"name":"HTML5"},{"name":"ProjectGlass"},{"name":"google"},{"name":"BoF"},{"name":"appengine"},{"name":"BruGTUG"},{"name":"android"},{"name":"Chrome"}],"summary":"Informal meeting with GDG/AUG leads and enthusiasts. Bring up any topic on organizing events, Android, App Engine, Chrome(OS) and Chromium(OS), Dart, Google APIs (Maps, YouTube), Glass, Go, Cloud, HTML5 and design, or just come brainstorm ideas.\n\nGDGs are Google Developer Groups. This BoF is held \"open for all\" by the BruGTUG GDG chapter in Belgium.","id":3526,"title":"GDGs and Android User Groups BoF","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1242","speaker":"Pieter-jan Vandormael","speakerId":1242},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1138","speaker":"Friedger Müffke","speakerId":1138}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"Testing"},{"name":"android"},{"name":"Eclipse"},{"name":"Tools"}],"summary":"Genymotion is a super fast Android emulator based on AOSP and running on VirtualBox.\r\nDuring this talk, we will explain how the Genymotion emulator can make application testing easier and faster.\r\nThe speaker will focus on :\r\n- New functions available in Genymotion\r\n- Automatic testing with the Genymotion Shell\r\n- Integration with CI tools\r\n\r\n\r\nPrivate Message for the program team :  \r\nWe launched Genymotion for 3 weeks now and we recieved a very good welcome with more than 15,000 users! \r\nhttp://genymotion.com","id":3710,"title":"Genymotion, the next generation Android emulator","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1583","speaker":"Daniel Fages","speakerId":1583}],"type":"Tools in Action","room":"Room 9"},{"tags":[{"name":"google"},{"name":"maps"},{"name":"android"}],"summary":"As part of the Google Play services - a platform that offers a better integration with Google products - Google recently released perhaps one of the most frequently requested upgrade: the Google Maps Android API v2. This new framework allows you to embed standard or customized maps directly in your application. Now Google Maps Android API v2 lets you leverage Google's beautiful new vector based maps.\n\nIn this session, we will learn about the new API and features introduced with Google Maps Android API v2 and how to start visualizing information geographically within your applications.","id":3621,"title":"Getting around with Google Maps Android API v2","track":"Mobile","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1619","speaker":"Cyril Mottier","speakerId":1619}],"type":"Tools in Action","room":"Room 9"},{"tags":[{"name":"webgl"},{"name":"BigQuery"},{"name":"golang"},{"name":"appengine"},{"name":"maps"},{"name":"big data"},{"name":"cloud"},{"name":"Architecture"}],"summary":"This talk shows how we were able to get a dynamic visualization of the position and trajectory of all the ships in the world using a set of cloud products.\n\nDue to the chosen architecture, the resulting system is fast, robust, and reliable. We'll have a fast look of the functional aspects of the application before getting into the details and the code itself.\n\nVisualizing ships is fun!! And the chosen architecture is also useful as a framework for many other similar big data applications.","id":3493,"title":"Go see all the ships in the world","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2577","speaker":"Francesc Campoy flores","speakerId":2577}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"real-time"},{"name":"event-driven"},{"name":"interactive"},{"name":"asynchronous"},{"name":"scalable"},{"name":"reactive"},{"name":"Concurrency"},{"name":"resilient"}],"summary":"The skills of building Event-Driven, Highly Concurrent, Scalable & Resilient Systems are becoming increasingly important in our new world of Cloud Computing, multi-core processors, Big Data and Real-Time Web. Unfortunately, many people are still doing it wrong; using the wrong tools, techniques, habits and ideas. In this talk we will look at what it means to 'Go Reactive' and discuss some of the most common (and some not so common but superior) practices; what works - what doesn't work - and why.","id":3313,"title":"Going Reactive: Event-Driven, Scalable & Resilient Systems","track":"Arch. & Security","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/807","speaker":"Jonas Bonér","speakerId":807}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"golo"},{"name":"JVM"},{"name":"Java7"},{"name":"Java8"},{"name":"language"}],"summary":"Golo is (yet another) dynamically-typed language for the JVM. It has been designed to leverage the capabilities JSR 292 (invokedynamic). Coupled with a minimal runtime that directly uses the Java SE APIs, Golo is an interesting language for rapid prototyping, polyglot application embedding, research (e.g., runtime extensions, language prototyping) and teaching (e.g., programming, dynamic language runtime implementation).\n\nThis session will show a tour of the language features through live demos. We will also discuss the broader JVM interoperability and highlight how invokedynamic allows for the design of a simple runtime with good performance figures when compared to other JVM languages.\n\nDuring this session, trolls against other JVM languages will be forbidden, as one of main motivation behind Golo is to make the design and implementation of JVM languages more approachable to the uninitiated. Still, we'll try to convince you that Golo can be useful in real-world applications, too!","id":3475,"title":"Golo, a simple post-invokedynamic language for the JVM","track":"JVM Languages","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/381","speaker":"Julien Ponge","speakerId":381}],"type":"Tools in Action","room":"Room 9"},{"tags":[{"name":"google"},{"name":"cloud"},{"name":"android"},{"name":"mobile"}],"summary":"You want to make your mobile application more reactive? Notify your users as soon as possible while preserving their device battery? Come and discover the power of Google Cloud Messaging in practice! After this \"tools in action\", Google Cloud Messaging won't have any secret for you. Furthermore, you will be able to implement it in your mobile application and your application server.","id":3357,"title":"Google Cloud Messaging in action!","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2595","speaker":"Thomas Guerin","speakerId":2595}],"type":"Tools in Action","room":"Room 5"},{"tags":[{"name":"google"},{"name":"authentication"},{"name":"authorization"}],"summary":"Learn how to easily take advantage of Google+ Sign-In for authorisation, access to the social graph, app activities and more across your native Android and iOS mobile applications. We'll cover the basics of implementation, best practices drawn from the most successful applications, and the latest changes to the SDKs.","id":3189,"title":"Google+ Sign-In on Android and iOS","track":"Arch. & Security","parleysIds":"5148922b0364bc17fc56c9d3","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2010","speaker":"Ian Barber","speakerId":2010}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"gradle"},{"name":"continuousdelivery"},{"name":"android"}],"summary":"We will talk about the new Gradle based Build System for the Android SDK. This new build system has been developed as a Gradle plugin by the Google Android team. It is full of innovation, many of them demonstrating the unique underlying capabilities of Gradle. We will also introduce Gradle as such with a special focus on the new features that have been developed as part of the Android effort. For example more generic, platform independent dependency management and the concept of library variants for different runtimes. We will show how these new features are extremely useful for other platforms like Javascript, Scala, Java and C++.\n\nThis talk is interesting for both, people interested in Android and people interested in Gradle who don't have a background in Android.","id":3598,"title":"Gradle for Android and the Rest of the World","track":"Mobile","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/958","speaker":"Hans Dockter","speakerId":958}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"event-driven"},{"name":"asynchronous"},{"name":"modularity"},{"name":"android"}],"summary":"Grenade is a small framework that offers an alternative to Fragment and Loader. Built on top of Dagger and Otto, it's an easy way to blow up your app into lots of little parts.","id":3380,"title":"Grenade for fragmenting Android apps","track":"Mobile","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2861","speaker":"Ray Ryan","speakerId":2861}],"type":"Tools in Action","room":"Room 9"},{"tags":[{"name":"reactor"},{"name":"grails"},{"name":"groovy"}],"summary":"Need to handle thousands or even millions of events per second? Don't want to loose valuable business data because you can't handle the volume? Let's make your application reactive! How will you deal with that? Let Guillaume and Stéphane tell you all about sharp tools -- Groovy, Reactor, and Grails -- that will let you pick up pace with modern apps.\r\n\r\nReactor is a new foundation for asynchronous applications on the JVM, which supports event-driven architectures, empowers big and fast data scenarios, and blends nicely with other projects of the Spring.IO platform.\r\n\r\nGroovy, the popular programming language for the JVM, provides a powerful and readable language for expressing your Reactor-driven logic, thanks to its closure functions, its DSL and static type extension capabilities.\r\n\r\nFinally, Grails, the Spring & Groovy-powered web development stack, piggy-packs atop both Groovy and Reactor to build the event-driven and reactive web application you've been dreaming of.","id":3752,"title":"Groovy, Reactor, Grails and the realtime web","track":"JVM Languages","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2521","speaker":"Stephane Maldini","speakerId":2521},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/6","speaker":"Guillaume Laforge","speakerId":6}],"type":"University","room":"Room 9"},{"tags":[{"name":"Clojure"},{"name":"SuperCollider"},{"name":"overtone"}],"summary":"Clojure is a modern lisp hosted on the JVM. It places an emphasis on functional programming, flexibility and concurrency. These characterstics make it a wonderfully powerful medium for many types of program from rapid prototypes to grand architectural projects. In this talk we will introduce one such project: Overtone, a sophisticated concurrent, real-time, low-latency, hot-swappable environment, both flexible and live enough for the creation and manipulation of music.\r\n\r\nThrough live demonstration and performances, we will explore some of the architectural designs within Overtone using Ignite, the codebase that powers the live-coding band Meta-eX.\r\n\r\nExpect serious technology, serious noise and serious fun. However, this is just a warm-up - come and see us perform at the Noxxx party.","id":3736,"title":"Hack Your Own Band With Clojure and Overtone","track":"JVM Languages","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3060","speaker":"Jonathan Graham","speakerId":3060},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3059","speaker":"Sam Aaron","speakerId":3059}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"IDE"},{"name":"scala"},{"name":"REST"},{"name":"web"},{"name":"Ceylon"},{"name":"groovy"}],"summary":"This session is your chance to contribute to the open source projects you've been learning about. Instead of a presentation, we will come together with several open source experts and write a plugin, a small feature, or a bug fix for a project that interests you. This is your chance to get involved with opens source and learn how to make a difference for the projects you're passionate about. Bring your laptop and your ideas; everyone is welcome. \n\nThese are just some of the experts that have participated in the past: Hans Dockter (Gradle Lead), Andres Almiray (Java Champion, Griffon Lead, and Groovy Committer), Stephen Chin (Java Champion, JavaFX and Android Expert), Hamlet D'Arcy (CodeNarc and Groovy Committer), Peter Gromov (IntelliJ IDEA guru), Dan Allen (Asciidoctor, CDI), Gavin King (Ceylon, Hibernate), Sven Reimers (NetBeans Dream Team)","id":3179,"title":"Hackergarten Hands-On Coding Event","track":"Java EE","parleysIds":"514892290364bc17fc56c577","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/5","speaker":"Andres Almiray","speakerId":5}],"type":"Hands-on Labs"},{"tags":[{"name":"MapReduce"},{"name":"Hadoop"},{"name":"cascading"},{"name":"big data"},{"name":"Hive"},{"name":"pig"}],"summary":"You sit on a big pile of data. You have lots of it and it’s great. But how on earth are you gonna make sense out of this awful amount of raw figures ? Hadoop is a great tool for storing and interrogating data, but it can be queried in various ways and it’s not always easy to choose the best one.\n\nIn this Hands-On, we will play together with 4 typical query languages that will help you mine your data :\n- Hive\n- Pure Java Map/Reduce\n- Pig\n- Cascading\n\nAfter this session, you’ll be prepared to enter the wonderful world of Hadoop querying.","id":3483,"title":"Hadoop data mining swiss army knife","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2905","speaker":"Alexandre Dutra cançado","speakerId":2905},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2885","speaker":"Bertrand Dechoux","speakerId":2885},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1630","speaker":"Pablo Lopez","speakerId":1630}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"scala"},{"name":"reactive"},{"name":"PlayFramework"},{"name":"websockets"}],"summary":"Reactive Architectures are the next major evolution of the Internet.  They allow for applications to be built in a completely non-blocking, asynchronous, and reactive manner.  The Play Framework fully embraces this new paradigm of programming  which allows developers to write asynchronous applications using either Scala or Java.   \r\n\r\nIn this hands-on session we will be building a reactive Play application.  The application will use Play to asynchronously read from a web service and stream it to the client using websockets and JSON.  In building this sample you will learn the basics of how a Play application is structured and the tools it provides for building event-driven applications.   The primary lab will be in Scala, but participants can also use Java if they prefer.","id":3462,"title":"Hands-on with Play and Scala - Learn to build a reactive application!","track":"JVM Languages","parleysIds":"51c0c876e4b0d38b54f461f6","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2871","speaker":"James Ward","speakerId":2871},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2873","speaker":"Ryan Knight","speakerId":2873}],"type":"Hands-on Labs","room":"BOF 2"},{"tags":[{"name":"End-to-Endtesting"},{"name":"Maven"},{"name":"Selenium"}],"summary":"In this quickie I will present you the evolution of the selenium tester.\nFrom using the Selenium IDE, to the selenium java tests, and finally the page factory pattern.\n\nThen I'll show you how to go beyond that and have type safe integration tests !\n\nThe implementation of this idea made possible complex and large functional tests on enterprise applications.","id":3637,"title":"How about some type safe Selenium tests ?","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1578","speaker":"Florent Ramière","speakerId":1578}],"type":"Quickie","room":"Room 4"},{"tags":[{"name":"BigQuery"},{"name":"google"},{"name":"big data"}],"summary":"Google BigQuery is a data analysis service that can crunch through terabytes of data in a couple tens of seconds, even with complex SQL queries. It is one of the most used tools at Google internally which is why we made it available to all. We also published a scientific article explaining the algorithms involved (\"Dremel: Interactive Analysis of Web-Scale Datasets\").\n\nThis session goes through the algorithms explained in the paper in a simplified and hopefully accessible way.","id":3421,"title":"How Google BigQuery works (for dummies)","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1622","speaker":"Martin Gorner","speakerId":1622}],"type":"Tools in Action","room":"Room 9"},{"tags":[{"name":"Atlassian"},{"name":"Methodology"},{"name":"agile"}],"summary":"With Kick-Ass Software Development you actually get stuff done. Feedback cycles are short, code quality is awesome and customers get the features they lust after. Less managers managing, less testers testing and less IT-operators operating. The developers take the power back, making them much happier. Sound like paradise? It is!\r\n\r\nThis session will show you how we do Kick-Ass Software Development at Atlassian. I will talk about how we: use pull requests for better code quality; collaborate fast to develop ideas; avoid meetings to get more stuff done; tighten our feedback loops to fail faster; shorten our release cycles; and work together happily on different continents. It's a great way to develop software and we think it can work in your company, too.","id":3143,"title":"How To Do Kick-Ass Software Development","track":"Methodology","parleysIds":"5148922b0364bc17fc56c8d3","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/841","speaker":"Sven Peters","speakerId":841}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"userexperience"},{"name":"rant"},{"name":"android"}],"summary":"Come and learn how to make your Android apps suck harder than a black hole. After this session you'll be earning 1-star app reviews like a boss!","id":3241,"title":"How to make your Android apps suck. A rant.","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2794","speaker":"Litrik De roy","speakerId":2794}],"type":"Quickie","room":"Room 5"},{"tags":[{"name":"javase"},{"name":"javaee"},{"name":"jcp"},{"name":"Java"},{"name":"community"},{"name":"javame"}],"summary":"The Java Community Process (JCP) is key to the evolution of Java. This session emphasizes the value of transparency and participation in the JCP program, Java user groups (JUGs), and the Adopt-a-JSR program. You will also hear about some upcoming changes to the Java Specification Request (JSR) process through the JCP.next effort, and learn how you can get involved. Come with your questions/suggestions and leave with the motivation and information you need to become an active participant in advancing the Java platform.","id":3355,"title":"How to Participate in the Future of Java","track":"Java SE","parleysIds":"5148922b0364bc17fc56c8db","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2113","speaker":"Heather Vancura","speakerId":2113}],"type":"Quickie","room":"Room 6"},{"tags":[{"name":"Jetty"},{"name":"SPDY"},{"name":"HTTP"}],"summary":"This talk is mainly about SPDY / HTTP/2.0 and a bit about Jetty 9's new network layer and the integration of new protocols like SPDY into the server.\nIt'll briefly explain the design goals and decisions of the protocol. Then show an amazing demo on how SPDY + PUSH can speedup every java webapplication without any code change.\nAlso very interesting for the audience is a small part that shows how to decrypt SSL traffic in wireshark and to decode it to SPDY.\n\nThis is a two-way talk. So the audience can decide where we'll go into detail and can discuss the contents with the speaker. These kind of two-way communication is usually very interesting for the audience as they're being part of it.","id":3398,"title":"HTTP 2.0/SPDY and Jetty in depth","track":"Web & HTML5","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/201","speaker":"Simone Bordet","speakerId":201},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1873","speaker":"Thomas Becker","speakerId":1873}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"HTTP"},{"name":"caching"},{"name":"apache"}],"summary":"HTTP has been designed to improve application performances by providing support for response caching. \r\nBut with great power comes great responsibilities, and having efficient HTTP caching requires a clean URI design and a proper usage of HTTP request and response headers.\r\n\r\nIn this quickie session, you'll get an overview of how HTTP caching works and how you can take benefit of it to reduce the load on your Java applications.","id":3586,"title":"HTTP Caching in Practice","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1471","speaker":"Xavier Coulon","speakerId":1471}],"type":"Quickie","room":"Room 8"},{"tags":[{"name":"multicore"},{"name":"Lambda"},{"name":"FunctionalProgramming"},{"name":"collections"},{"name":"Java8"},{"name":"parallel"}],"summary":"Enabling bulk data-parallel operations on collections and other aggregates was a key driver for adding lambda language features to Java SE 8. The centerpiece of the Java SE 8 libraries is the new Streams parallel bulk-data API. This session examines the architecture of the Streams API and its implementation in depth providing insights for how to get the best performance and scalability from the library both now and in the future.","id":3222,"title":"In full flow: Java 8 lambdas in the stream","track":"Java SE","parleysIds":"516bff75e4b05b6ad71fa761","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/224","speaker":"Paul Sandoz","speakerId":224}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"robotics"},{"name":"RaspberryPI"},{"name":"JavaSE8"},{"name":"technology"}],"summary":"We bring the \"things\", you do the hacking...\r\n\r\nWith new low cost devices entering the market, access to the world of embedded computing is become more cost affordable. And, with continued advances in Java, developers can easily begin creating innovative applications that leverage these low cost devices.\r\n\r\nSimon and I will bring a variety of embedded devices, sensors, screens, and toys that you can program in Java. After a short demonstration, we will give you the opportunity to experiment with the hardware to create your own innovative device mashups.  Let's see what creativity the Devoxx audience can come up with to build the Future!","id":3227,"title":"Internet-of-Things Hackerspace","track":"Future<Devoxx>","parleysIds":"5148922b0364bc17fc56c8cd","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1928","speaker":"Angela Caicedo","speakerId":1928},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1912","speaker":"Simon Ritter","speakerId":1912},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/98","speaker":"Stephen Chin","speakerId":98}],"type":"Hands-on Labs","room":"BOF 1"},{"tags":[{"name":"IDE"},{"name":"javaee"},{"name":"Tools"}],"summary":"Have you ever struggled with adding a wizard to your IDE? Ever created a development tool and thought, \"It's a shame I'd have to re-write the same code for every IDE\"? Have you ever found yourself switching between IDE and command-line because the best tool for the job is never in both places?\r\nIf your answer to any of these questions was \"YES!\", then come take a look at Forge 2, because this session is for YOU. In this quickie, see how easy it is to create a Forge 2 command that runs in any IDE of your choice.","id":3607,"title":"Introducing Forge 2","track":"Java EE","parleysIds":"5148922b0364bc17fc56c98b","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1499","speaker":"Koen Aers","speakerId":1499}],"type":"Quickie","room":"Room 7"},{"tags":[{"name":"scalability"},{"name":"polyglot"},{"name":"frameworks"}],"summary":"Vert.x is a lightweight, high performance, application platform for the JVM that's designed for modern mobile, web, and enterprise applications.\n\nThe recent Vert.x 2.0 release marks a coming of age for Vert.x, as it progresses to a fully independent project.\n\nWe'll dive into the Vert.x 2.0 release and show how the powerful new module system enables a Vert.x ecosystem by allowing modules to be re-used via Maven and Bintray repositories.\n\nYou'll also learn about how better build tool and IDE integration makes developing applications with Vert.x a breeze.\n\nYou'll also learn about the up and coming Scala, Clojure support, and Node.js drop in compatibility which will take Vert.x to an even broader set of users.","id":3690,"title":"Introducing Vert.x 2.0 - Taking polyglot application development to the next level","track":"Web & HTML5","parleysIds":"5148922b0364bc17fc56c8c7","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2060","speaker":"Tim Fox","speakerId":2060}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"ProjectGlass"},{"name":"google"},{"name":"wearable"}],"summary":"During this session, I will introduce the Google Glass, describe how they work, explain how to program them with the Mirror API, and provide feedback on my experience as a #GlassExplorer for the last 6 months.","id":3733,"title":"Introduction to Google Glass","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1435","speaker":"Alain Regnier","speakerId":1435}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"webkit"},{"name":"Chromium"},{"name":"NodeJS"}],"summary":"Introduction to the node-webkit runtime, which supports writing cross-platform native applications with Web technologies. node-webkit combines Node.js and Chromium to provide a runtime that UI is written with HTML/CSS/JS and native capabilities are provided by many Node.js libraries. Features and usage examples are to be introduced in this session.","id":3744,"title":"Introduction to the node-webkit runtime","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3069","speaker":"Roger Wang","speakerId":3069}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"invokedynamic"},{"name":"JVM"},{"name":"android"},{"name":"language"}],"summary":"This talk will start with an introduction on Dalvik, the maybe/maybe not Java virtual machine of Android. We will explain how the interpreter, the JIT, the GC works and highlight the difference with the Oracle or the IBM Virtual Machine.\n\nWe will then explain, how Dalvik was modified to enable dynamic language that use invokedynamic like JRuby, Groovy, Golo, Magik, etc to run on Android on simple examples.\n\nAnd if gods are good with us, we will finish by demoing the examples we have explained previously.","id":3627,"title":"Invokedynamic (Java 7) on Android","track":"Mobile","parleysIds":"517af3a5e4b0736a5fa66a20","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1479","speaker":"Remi Forax","speakerId":1479},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3442","speaker":"Jérôme Pilliet","speakerId":3442}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"javafx"},{"name":"embeddedjava"},{"name":"RaspberryPI"}],"summary":"Since 2001 all petrol engined cars sold in Europe are required to be fitted with a European On Board Diagnostics (EOBD) interface.  Low cost connections to this provide Wi-Fi access to raw car system data.  The Raspberry Pi provides a low cost ARM processor based embedded system for multiple uses. This session will look at how Embedded Java and a Raspberry Pi has been used to communicate with the diagnostic and management systems of an Audi S3 and process the data.  With the addition of a touch screen we will show how JavaFX has been used to provide an in-car informatics system for less than $200.\n\nAdding an accelerometer to the hardware configuration allows us to measure the forces affecting the car.  Exciting data like G-forces, lateral loads, power output and acceleration times can all be added to the display.  By accessing CAN bus data it is even possible to repurpose things like steering wheel buttons to provide hands-free control of the interface.\n\nVideos of the system in action","id":3569,"title":"Is It A Car? Is It A Computer? No, It’s a Raspberry Pi JavaFX Informatics System","track":"Future<Devoxx>","parleysIds":"5148922b0364bc17fc56c8f7","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1912","speaker":"Simon Ritter","speakerId":1912}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"javase"},{"name":"JavaSE8"},{"name":"JavaSE9"}],"summary":"Update on Java 8 and beyond by Mark Reinhold and Brian Goetz.","id":3726,"title":"Java 8 and beyond keynote","track":"Java SE","parleysIds":"514892290364bc17fc56c489","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/279","speaker":"Mark Reinhold","speakerId":279},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/283","speaker":"Brian Goetz","speakerId":283}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"RaspberryPI"},{"name":"javame"},{"name":"IoT"}],"summary":"This is not your grandfather's Java ME.  Deep dive and demonstration on the new Java Embedded support for ARM processors.  We will demonstrate the full power of Java 8 with lambdas running on embedded devices such as Raspberry Pi and PandaBoard, the new Lego Mindstorms EV3, and powering the Internet of Things with embeddable ARM processors.  See end-to-end coding on devices, discuss coding practices for building performant applications, and learn how to kick-start your own crowd-sourced device project.","id":3750,"title":"Java 8 for Pis, Legos, and the Internet of Things","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/98","speaker":"Stephen Chin","speakerId":98},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1251","speaker":"Vinicius Senger","speakerId":1251}],"type":"University","room":"Room 4"},{"tags":[{"name":"Lambda"},{"name":"JavaSE8"}],"summary":"There is a good amount of excitement about the new version of Java. The big evolution of course is the lambda expressions. In this presentation we will dive into the language features in Java 8, take a look at some of their nuances, and look at ways to put them to good use.","id":3727,"title":"Java 8 Language Capabilities - What's in it for you?","track":"JVM Languages","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3043","speaker":"Venkat Subramaniam","speakerId":3043}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"HTML5"},{"name":"Glassfish"},{"name":"javaee7"}],"summary":"The Java EE 7 platform focuses on Boosting Productivity and Embracing HTML5. JAX-RS 2 adds a new Client API to invoke the RESTful endpoints. JMS 2 introduces a new simplified API to align with improvements in the Java language. Long awaited Batch Processing API and Concurrency Utilities are now part of platform offering richer functionality. A new API to build WebSocket driven applications and JSON parsing and generation is now included in the platform. JavaServer Faces has added support for HTML5 forms. Several other improvements are available in this latest version of the platform. Together these APIs will allow you to be more productive by simplifying enterprise development. This hands-on lab will provide a comprehensive introduction to the updated Java EE 7 platform using GlassFish 4. The attendees will learn the design patterns of building an application using Java EE 7.","id":3242,"title":"Java EE 7 Hands-on Lab","track":"Java EE","parleysIds":"516bf8fce4b05b6ad71fa75b","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/23","speaker":"Arun Gupta","speakerId":23},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/116","speaker":"Antonio Goncalves","speakerId":116}],"type":"Hands-on Labs","room":"BOF 1"},{"tags":[{"name":"HTML5"},{"name":"websockets"},{"name":"javaee7"}],"summary":"This talk will examine the Java API for WebSocket, a key new Java API in Java EE 7. You'll understand how to use the API in web applications and also how to use the client API to write rich clients in addition to your browser clients.\nFinally efficient server-push of web data is here, no more long polling or AJAX. Find out about this foundation piece of HTML 5 and this new API in Java EE 7.","id":3391,"title":"Java EE 7's Java API for WebSocket","track":"Java EE","parleysIds":"516452ffe4b082c6506c9e45","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/23","speaker":"Arun Gupta","speakerId":23}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"javaee"},{"name":"JMS"},{"name":"javaee7"},{"name":"EJB3.2"}],"summary":"Java EE 7 continues the simplification of the APIs for accessing container services while broadening the range of services available. This platform overview focuses on the following areas:\r\n\r\n• Extension of the platform to encompass emerging Web technologies such as WebSocket and JSON, which provide the underpinnings for HTML5 support in Java EE, as well as the HTTP client API added by JAX-RS\r\n\r\n• Simplified alignment of managed beans by the leveraging of CDI injection and interceptors to include new JTA declarative transactions, method-level validation, and constructor injection\r\n\r\n• Enhancements for ease of use, including simplified JMS APIs, the new batch API, expanded resource definition facilities, and the pruning of superseded technologies","id":3739,"title":"Java EE 7: What’s New in the Java EE Platform","track":"Java EE","parleysIds":"514892250364bc17fc56bad5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/184","speaker":"David Delabassee","speakerId":184}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"JMS"},{"name":"javaee7"},{"name":"EJB3.2"}],"summary":"ava EE 7 continues the simplification of the APIs for accessing container services while broadening the range of services available. This platform overview focuses on the following areas:\r\n• Extension of the platform to encompass emerging Web technologies such as WebSocket and JSON, which provide the underpinnings for HTML5 support in Java EE, as well as the HTTP client API added by JAX-RS\r\n• Simplified alignment of managed beans by the leveraging of CDI injection and interceptors to include new JTA declarative transactions, method-level validation, and constructor injection\r\n• Enhancements for ease of use, including simplified JMS APIs, the new batch API, expanded resource definition facilities, and the pruning of superseded technologies","id":3740,"title":"Java EE 7: What’s New in the Java EE Platform","track":"Java EE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/23","speaker":"Arun Gupta","speakerId":23},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/184","speaker":"David Delabassee","speakerId":184},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/116","speaker":"Antonio Goncalves","speakerId":116}],"type":"University","room":"Room 8"},{"tags":[{"name":"javaee"},{"name":"analysis"},{"name":"Java7"}],"summary":"Get together of all Java EE people around.\nDiscussion topics of interest. Ideas and wishes for Java EE 8, feedback on EE 7 .. and so on ...","id":3187,"title":"Java EE Gathering","track":"Java EE","parleysIds":"516bf8fce4b05b6ad71fa75b","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/184","speaker":"David Delabassee","speakerId":184}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"performance"},{"name":"Benchmarking"},{"name":"openjdk"}],"summary":"Measuring the performance is the fine art, and measuring the performance on microbenchmarks is double so. There are multiple caveats one should take a great care of while designing the experiment involving microbenchmarks. The advanced experience with VM technology is required, the exposure with particular nits on exact VM is also a plus.\n\nSome say the benchmarking is inherently evil. We agree with that assertion, but also realize the benchmarking is nevertheless essential, and we need to learn how to benchmark without shooting ourselves in the foot all the time. In this session, we take the crash course in fine microbenchmarking, and introducing OpenJDK's Java Microbenchmark Harness (JMH) along the way.","id":3628,"title":"Java Microbenchmark Harness: The Lesser of Two Evils","track":"Methodology","parleysIds":"5148922b0364bc17fc56c9ed","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2932","speaker":"Aleksey Shipilev","speakerId":2932}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"JUG"},{"name":"Methodology"},{"name":"SoftwareCraftsmanship"}],"summary":"The annual get together where the JUG leaders discuss best practices, Oracle's stewardship and any other hot topics under the sun.","id":3215,"title":"Java User Group (JUG) Leaders BOF","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/617","speaker":"Mattias Karlsson","speakerId":617},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/405","speaker":"Martijn Verburg","speakerId":405},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2","speaker":"Stephan Janssen","speakerId":2},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/116","speaker":"Antonio Goncalves","speakerId":116}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"javafx"},{"name":"ARM"},{"name":"RaspberryPI"},{"name":"javame"}],"summary":"With the new ARM support for Java SE and ME, Java can run on embedded devices from large to small, letting your code interact with the physical world.  We will show you how Java server and client technologies can work together to build an end-to-end scenario that enables cloud-powered devices for the Internet of Things.  This presentation will include demonstrations of JavaFX 3D technology on desktop and embedded, the new Java Device API for interacting with physical sensors and motors, and Java EE 7 features for cloud integration, all themed around chess as the universal geek game of choice...  \"Shall we play a game?\"","id":3770,"title":"Java, Chess, and the Internet of Things","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/98","speaker":"Stephen Chin","speakerId":98},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/264","speaker":"Richard Bair","speakerId":264}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"JavaPosse"}],"summary":"Come and have fun and drink beer with us as the Java Posse record a sitrep from Devoxx. Along the way, we may even manage to get some Java related material in the session.","id":3713,"title":"JavaPosse LIVE","track":"Java SE","parleysIds":"5148922b0364bc17fc56c918","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/272","speaker":"Dick Wall","speakerId":272},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/129","speaker":"Chet Haase","speakerId":129}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"Jetty"},{"name":"SPDY"},{"name":"HTTP"}],"summary":"Meet with key members of the Jetty development team to discuss the new features of Jetty-9 (Websocket, SPDY, etc.) and to discuss the future development of the server.\n\nThe Jetty server has gone through a significant rearchitecture with it's Jetty-9 release to build in support for multiple multiplexed protocols (eg SPDY, HTTP/2.0 and Websockets). This session is an opportunity for two way interaction between the open source community and user base of this popular HTTP server and servlet container.","id":3397,"title":"Jetty Community BOF","track":"Java EE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/201","speaker":"Simone Bordet","speakerId":201},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1873","speaker":"Thomas Becker","speakerId":1873}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"javase"},{"name":"javaee"},{"name":"jcp"},{"name":"Java"},{"name":"community"},{"name":"javame"}],"summary":"Learn how to take part in Java technology evolution through the Java Community Process (JCP) program. You can participate as an individual, corporation, or nonprofit such as a Java user group (JUG). This session gives you step-by-step instructions on how to participate in the Adopt-a-JSR program and the Transparency project and provides tools for running JUG events as part of the Adopt-a-JSR program. We will discuss details such as how to run hack days, translate content into local languages, and collaborate with other JUG leads on Adopt-a-JSR activities. In addition, highlights of use cases from JUG hack days and applications developed through the Adopt-a-JSR program.","id":3354,"title":"Join the Java Evolution BOF: JCP & Adopt-a-JSR Workshop","track":"Java SE","parleysIds":"516c005ae4b05b6ad71fa762","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/405","speaker":"Martijn Verburg","speakerId":405},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/110","speaker":"Johan Vos","speakerId":110},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2111","speaker":"Patrick Curran","speakerId":2111},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2113","speaker":"Heather Vancura","speakerId":2113}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"security"},{"name":"transform"},{"name":"reduceBoilerplate"}],"summary":"JTransfo is a library which allows you to indicate in your transfer objects how they map to your domain objetcs. This allows you to avoid a lot of boiler plate code in your application. jTransfo can also help you with security and constraint checking. You can indicate which fields should be copied in which cases, based on tags which can for example represent user roles or object state.","id":3378,"title":"JTransfo, converting between transfer and domain objects","track":"Arch. & Security","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/185","speaker":"Joachim Van der auwera","speakerId":185}],"type":"Quickie","room":"Room 4"},{"tags":[{"name":"Testing"},{"name":"jUnit"},{"name":"multithreading"}],"summary":"JUnit is one of the leading testing tools for Java, often though the tutorials are limited to simple examples. In this talk we take a hands on approach to developing a multithreaded component using TDD. Along the way we'll explore some JUnit specific features such as runners and rules; as well as testing libraries that can be used regardless of the testing framework. Following this session you will be able to create tests for real-world multithreaded applications.","id":3339,"title":"JUnit PowerUp: Practical Testing Tips","track":"Methodology","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/766","speaker":"James Mcgivern","speakerId":766}],"type":"Tools in Action","room":"Room 8"},{"tags":[{"name":"bytecode"},{"name":"compiler"},{"name":"instrumentation"}],"summary":"This talk gets you started with JVM bytecode engineering. Kees Jan peels away the fluffy Java language syntax to lay bare the gears that make the JVM tick. He will show what options there are for you to compile bytecode and create classes just the way you want them to be. The talk starts by looking at the low level JVM architecture and the byte code design. You will learn how to compile your own class files from byte code. Kees Jan will demonstrate a number of byte code assemblers and disassemblers, discussing pro and con of each. You walk away from this talk with a solid understanding of class files and the JVM and byte code architectures. This talk is open for any developer who programs Java for their day job.","id":3382,"title":"JVM bytecode engineering 101","track":"JVM Languages","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/819","speaker":"Kees jan Koster","speakerId":819}],"type":"University","room":"Room 5"},{"tags":[{"name":"RaspberryPI"},{"name":"leap-motion-controller"},{"name":"IoT"}],"summary":"During the hands-on lab we'll help kickstart your Raspberry PI and/or LeapMotion project by providing you the hardware and knowledge to get things done!   Just bring your portable and we'll provide the rest.  Internet of Thins... here you come!","id":3747,"title":"Kickstart your Raspberry PI and/or LeapMotion project","track":"Future<Devoxx>","parleysIds":"514892290364bc17fc56c4cc","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2744","speaker":"Geert Bevin","speakerId":2744},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3089","speaker":"Yara Senger","speakerId":3089},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1251","speaker":"Vinicius Senger","speakerId":1251}],"type":"Hands-on Labs","room":"BOF 2"},{"tags":[{"name":"RaspberryPI"},{"name":"leap-motion-controller"},{"name":"arduino"}],"summary":"During the hands-on lab we'll help kickstart your Raspberry PI and/or LeapMotion project by providing you the hardware and knowledge to get things done! Just bring your portable and we'll provide the rest. Internet of Thins... here you come!","id":3765,"title":"Kickstart your Raspberry PI and/or LeapMotion project (part 2)","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2744","speaker":"Geert Bevin","speakerId":2744},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3089","speaker":"Yara Senger","speakerId":3089},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1251","speaker":"Vinicius Senger","speakerId":1251}],"type":"Hands-on Labs","room":"BOF 1"},{"tags":[{"name":"Java"},{"name":"Lambda"},{"name":"Java8"}],"summary":"Interested in trying out the new lambda feature in Java 8? If so, this “higher-order lab” is for you. Participants will use a recent JDK 8 development build and a recent NetBeans build that support the lambda feature and will take part in exercises intended to teach them about the new lambda feature of the Java programming language and the new Streams Library API. The exercises start off very simply, so that beginners can learn the fundamentals. Additional exercises covering grouping and parallel reduction aim to challenge more-advanced participants. Participants need not have any prior knowledge of Java’s lambda feature, although having attended a prior JavaOne lambda session or tutorial will be helpful.","id":3293,"title":"Lambda programming lab","track":"Java SE","parleysIds":"516bff75e4b05b6ad71fa761","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2592","speaker":"Stuart Marks","speakerId":2592},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1928","speaker":"Angela Caicedo","speakerId":1928},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1912","speaker":"Simon Ritter","speakerId":1912}],"type":"Hands-on Labs","room":"BOF 2"},{"tags":[{"name":"closures"},{"name":"JavaSE8"},{"name":"Lambda"}],"summary":"The big language features for Java SE 8 are lambda expressions (closures) and default methods (formerly called defender methods or virtual extension methods). Adding closures to the language opens up a host of new expressive opportunities for applications and libraries, but how are they implemented? You might assume that lambda expressions are simply a more syntactically compact form of inner classes, but, in fact, the implementation of lambda expressions is substantially different and builds on the invokedynamic feature added in Java SE 7. Learn more in this session.","id":3734,"title":"Lambda: A Peek Under the Hood","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/283","speaker":"Brian Goetz","speakerId":283}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"Awesome"},{"name":"Noise"},{"name":"Funny"},{"name":"French"},{"name":"Podcast"}],"summary":"Don't know French, now is the time to learn and join us.\n\nRejoignez-nous pour clore cette nouvelle édition de Devoxx dans la joie et la bonne humeur. Les Cast Codeurs y commenterons ce cru 2013.\n\nPour ceux qui ne savent pas, Les Cast Codeurs est un podcast en Français pour les développeurs, par les développeurs qui conte les évènements Java tout au long de l'année. Ecoutez nous sur http://lescastcodeurs.com et rejoignez-nous pour cet enregistrement.\n\nAttention, tout ce que vous pourrez dire sera retenu sur cassette ;)","id":3430,"title":"Les Cast Codeurs Podcast - Episode en direct et en public!","track":"Java SE","parleysIds":"517a3b5de4b0c6dcd9546447","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1414","speaker":"Vincent Massol","speakerId":1414},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/647","speaker":"Arnaud Heritier","speakerId":647},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/117","speaker":"Emmanuel Bernard","speakerId":117},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/6","speaker":"Guillaume Laforge","speakerId":6},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/116","speaker":"Antonio Goncalves","speakerId":116}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"NAO"},{"name":"GreenFoot"},{"name":"arduino"}],"summary":"In this BOF we'll explain how to start a Devoxx4Kids in your own city.  Expect practical advice, how to's, do's and don'ts etc.\r\n\r\nTurn yourself into a hero for your teenage son or daughter and join the Devoxx4Kids movement!  :)","id":3151,"title":"Lessons learned from Devoxx4Kids","track":"Future<Devoxx>","parleysIds":"516bfb14e4b05b6ad71fa75d","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1750","speaker":"Daniel De luca","speakerId":1750},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2054","speaker":"Konrad Malawski","speakerId":2054},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/284","speaker":"Roy Van rijn","speakerId":284},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/527","speaker":"Tasha Carl","speakerId":527},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1982","speaker":"Linda Van der pal","speakerId":1982}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"game"},{"name":"Java"},{"name":"iOS"},{"name":"android"},{"name":"opengl"},{"name":"cross-platform"}],"summary":"Wait ... what ?\nI can develop a game in JAVA and deploy it on PC/MAC/Android/iOS/HTML5 ?\n\nYes, and you need to see it live !\n\n15 minutes from start to finish and you'll love it.\n\nBonus: if you are a scala fan you'll be happy too !","id":3636,"title":"LibGDX Desktop/Android/iOS/HTML5 Java game development framework","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1578","speaker":"Florent Ramière","speakerId":1578}],"type":"Quickie","room":"Room 8"},{"tags":[{"name":"Methodology"},{"name":"SoftwareCraftsmanship"},{"name":"SelfDevelopment"}],"summary":"Is programming, especially in the enterprise world, all about wrapping your head around plethora of frameworks or understanding how singleton, proxy, factory or bean works in the given context? Is juggling with SOAP or REST all what is there to play with? Where are all these cool things we learned in the college? Are we really growing as programmers? If you have such doubts join me in this quickie to hear a bit of personal experience about the ways to improve as software developer.","id":3548,"title":"Life is too short to write CRUD","track":"Methodology","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/747","speaker":"Bartosz Majsak","speakerId":747}],"type":"Quickie","room":"Room 9"},{"tags":[{"name":"security"},{"name":"graph-theory"},{"name":"big data"}],"summary":"Networks are everywhere, many we knowingly provide data to that allow them to model us: Amazon, Facebook, credit cards. Other networks we assume to be generally private, e.g. postal mail. Recent events have highlighted that nearly any communication or activity might not be so private. But how to companies like Amazon or projects like PRISM work? How do they build their models? How do you derive meaningful data from these models? This session starts with an introduction to graph theory before looking at several algorithms related to link analysis and how they can be applied to networks to identify grouping or anomalous activity","id":3341,"title":"Link Analysis in Networks, or \"Finding the Terrorists\"","track":"Arch. & Security","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/766","speaker":"James Mcgivern","speakerId":766}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"kibana"},{"name":"analysis"},{"name":"big data"},{"name":"cloud"},{"name":"elasticsearch"}],"summary":"Let's inject tweets into elasticsearch and build live a dashboard using Kibana.\nIn 15 minutes, you will know how to build YOUR own dashboard and make sense of YOUR data.","id":3282,"title":"Make sense of your (BIG) data!","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1409","speaker":"David Pilato","speakerId":1409}],"type":"Quickie","room":"Room 9"},{"tags":[{"name":"CMS"},{"name":"Git"},{"name":"PlayFramework"}],"summary":"As a skilled developer, you master Java and you have already chosen your favourite framework, templating system, architecture and application server. So why would it be ok to settle for technical constraints imposed by a black box obsolete CMS technology, as soon as there's manageable content involved?\r\n\r\nprismic.io takes the other way: it lets you manage content, allows you to perform sophisticated queries on it, and it gets out of your way. That's why it gives you all the freedom to use the technology of your choice to build your website and apps.\r\n\r\nIn this talk will we show you how easy and fast it is to structure and organise content in prismic.io and display it in a Java application.","id":3762,"title":"Manage your content and integrate it using prismic.io, Java and your favourite framework","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/65","speaker":"Sadek Drobi","speakerId":65},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1291","speaker":"Guillaume Bort","speakerId":1291}],"type":"Tools in Action","room":"Room 4"},{"tags":[{"name":"google"},{"name":"android"},{"name":"mobile"}],"summary":"Over the past few years, the quality of apps in the Google Play Store has increased substantially. Developers are taking Android UI seriously and producing beautiful apps made of tons of graphics resources (Bitmaps, 9-patches, shapes, etc.) every day. To avoid developers the pain of handling all types of resources, the Android framework provides the Drawable abstraction.\r\n\r\nIn this session we will deep dive into the android.graphics.drawable package and how the framework uses it internally to render scalable and responsive UIs. The Drawable notion is essential to the creation of UIs on Android but developers usually only scratch the surface of it. The class will help you to understand how framework-provided and custom Drawables can be used to make both your code cleaner and your app better, smoother and more polished.","id":3779,"title":"Mastering Android Drawables","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1619","speaker":"Cyril Mottier","speakerId":1619}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"video"},{"name":"webrtc"},{"name":"audio"}],"summary":"A host of new Web technologies are transforming the way we create, distribute and consume media.\n\nIn this session, we help you understand the new APIs and show off some stunning real-world implementations.\n\n- WebRTC: what's new and what's next.\n- EME: what is it and how can I use it?\n- Media Source Extensions: for adaptive streaming, time shifting and more.\n- Web Audio: sophisticated audio.\n- <video> and <audio> update.\n- Transcripts, captions and the track element: deep linking and deep search.\n- Working with Web Components.\n- State of the codecs.\n- Best practice for mobile platforms.","id":3427,"title":"Media APIs for the multi-device web","track":"Web & HTML5","parleysIds":"5148922b0364bc17fc56c96b","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1084","speaker":"Sam Dutton","speakerId":1084}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"Windows"},{"name":"Azure"},{"name":"mobile"}],"summary":"This presentation has two parts, each addressing a different application development model, with the intention to provide insight on how you can leverage the Microsoft platforms for developing apps that run on mobile devices, as well as services that run in the cloud.\r\nFirst part provides an overview of the Windows Phone development platform. We will cover platform capabilities, application fundamentals, and all essential information to help you get a detailed understanding of how to build and deliver apps on Windows Phone devices.\r\nSecond part provides an overview of the Windows Azure cloud services platform. We will cover the rich set of platform services that applications can leverage, plus how Java can be used to build highly scalable applications that run in Windows Azure.","id":3755,"title":"Mobile and Cloud Application Development with Windows Phone and Windows Azure","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3105","speaker":"David Chou","speakerId":3105}],"type":"University","room":"Room 4"},{"tags":[{"name":"HTML5"},{"name":"dart"},{"name":"mobile"}],"summary":"Mobile web is a huge opportunity, and it's easier than ever to develop for. To demonstrate, we present our mobile-first, multi-player, multi-device, offline-friendly, touch-enabled \"tile-based word finding game\" built with web technologies. All the client and server code for this game was created with Dart, Google's new web programming platform, and runs across modern desktop and mobile browsers.\n\nThe solutions demoed work for any mobile web developer. The talks shows you, with working code, how to handle situations such as: flexible layouts for multiple devices, persistence for objects that live on client and server, running offline, integrating touch, authentication with OAuth2, and reusability with Web Components.\n\nAlong the way, we'll show how Dart's features, like mixins and reflection, helped us increase code reuse and minimize repetition. We'll also show you how we used numerous community packages for the client and server, such as assets, database connectivity, and more.","id":3411,"title":"Mobile, multi-device, multi-player with HTML5 and Dart","track":"Web & HTML5","parleysIds":"5148922b0364bc17fc56c8e9","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1775","speaker":"Seth Ladd","speakerId":1775}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"javaee"},{"name":"MongoDB"},{"name":"JPA"}],"summary":"NoSQL is making inroads everywhere we look these days, but for those of us who have spent years in Java EE, that transition can feel daunting. This presentation begins with a basic introduction to MongoDB and how data is organized. It covers options for getting data in and out of MongoDB and then walks through an example JPA application to show how it looks with different mapping options in MongoDB. It also explores how MongoDB’s paradigm can affect not only your object model but how you interact with the data as well.","id":3246,"title":"MongoDB for JPA Developers","track":"Java EE","parleysIds":"514892290364bc17fc56c581","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2765","speaker":"Justin Lee","speakerId":2765}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"Devoxx"}],"summary":"Trailer of the Devoxx movie and practical info about the Devoxx party.","id":3769,"title":"Movie and practical info","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2","speaker":"Stephan Janssen","speakerId":2}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"USB"},{"name":"Chrome"},{"name":"NFC"}],"summary":"Thanks to the chrome.usb API, we were able to build from scratch a Chrome App to handle all the NFC Wristband readers of this Conference.\r\nIn 15 minutes, I'm going to show you how we did it and how simple it is to build one right now.","id":3748,"title":"NFC + Chrome = Awesomeness","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3090","speaker":"Francois Beaufort","speakerId":3090}],"type":"Quickie","room":"Room 5"},{"tags":[{"name":"REST"},{"name":"best-practice"},{"name":"API"},{"name":"Versioning"}],"summary":"Versioning REST APIs is usually a hot debate, with proponents for   versioning the URL, and others to use custom MIME types.\n\nBut there are other ways to version REST APIs, some complementary to the above, yet others that promote backward and forward compatibility, without even using a version number!\n\nBy attending this session, you'll get acquainted with these different techniques, and the pros and cons of each.","id":3432,"title":"Not So Secrets of REST APIs Versioning","track":"Arch. & Security","parleysIds":"514892250364bc17fc56bc0f","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1896","speaker":"Stephane Rondal","speakerId":1896}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"javaee7"},{"name":"EJB3.2"},{"name":"interceptors"}],"summary":"Java EE 7 interceptors play a key role in aligning managed beans across the Java EE 7 platform and are a powerful tool for managing cross-component concerns. This session discusses the role of Java EE 7 interceptors in supporting method-level bean validation, the new JTA declarative transactions, and expanded lifecycle callback hooks. It also describes these new features and showcases tips, tricks, and best practices for their use.","id":3738,"title":"Nuts and Bolts of Java EE 7 Interceptors","track":"Java EE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/117","speaker":"Emmanuel Bernard","speakerId":117}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"quantifiedself"},{"name":"homeautomation"},{"name":"osgi"},{"name":"IoT"},{"name":"m2m"}],"summary":"New IoT devices and services are hitting the market constantly. But most of them are just connected to their own proprietary backend. A central coordination instance is missing to easily integrate them with each other!\n\nThe open source project openHAB addresses this problem: it connects to a multitude of different systems and comes with powerful automation rules and nice UIs. Its modular architecture guarantees simple extensibility. While running it on small and cheap embedded devices such as the Raspberry Pi, you can explore the world of home automation beyond the ordinary: do a presence simulation with the push of a button, see live charts of your sensor data, or adjust your irrigation schedule through Google Calendar.\n\nBe prepared to see geeky hardware in the live demo in this session.","id":3689,"title":"openHAB - the world of things at your fingertips","track":"Future<Devoxx>","parleysIds":"5148922b0364bc17fc56c8c3","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2068","speaker":"Thomas Eichstädt-engelen","speakerId":2068},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2067","speaker":"Kai Kreuzer","speakerId":2067}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"OpenShift"},{"name":"Java"},{"name":"cloud"}],"summary":"Ever wondered about the new Cloud offerings out there? What is a PaaS? What is this thing called OpenShift?\n\nWhether your business is running on applications based on Java EE6, PHP or Ruby, the cloud is turning out to be the perfect environment for developing your business. There are plenty of clouds and platform-as-a-services to choose from, but where to start? Join us for an action-packed hour of power where we'll show you how to deploy your existing application written in the language of your choice - Java, Ruby, PHP, Perl or Python, with the Java project of your choice deployed into the OpenShift PaaS in just minutes. All this and without having to rewrite your app to get it to work the way the cloud provider thinks your app should work.\n\nIf you want to learn about OpenShift PaaS and see how investing an hour of your time can change everything you thought you knew about the Cloud!\n\n(Speaker author e-book: OpenShift Primer, will give away free copies in session)","id":3274,"title":"OpenShift Primer - get your Applications into the Cloud","track":"Cloud & BigData","parleysIds":"514892290364bc17fc56c53f","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/927","speaker":"Eric d. Schabell","speakerId":927}],"type":"Tools in Action","room":"Room 9"},{"tags":[{"name":"Methodology"},{"name":"SoftwareCraftsmanship"},{"name":"analysis"}],"summary":"This talk, by the preeminent speaker on Software Process Methodology Process, will cover important developments in software development patterns which, if ignored, will lead to errors, failure, and bankruptcy. Miss this talk at your peril.","id":3193,"title":"Patterns, Shmatterns","track":"Methodology","parleysIds":"5148922b0364bc17fc56c959","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/129","speaker":"Chet Haase","speakerId":129}],"type":"Quickie","room":"Room 5"},{"tags":[{"name":"HTML5"},{"name":"Testing"},{"name":"web"},{"name":"coffeescript"},{"name":"javascript"}],"summary":"In this university session, we give an overview of  the main javascript testing tools. You will be in a position to appreciate their strengths and weakness in a java backend context.\n\nThis talk is mainly based on live coding. You will really see the details of CasperJS, Zombie.js, QUNit, Karma, Sinon and Buster.js to name a few...\n\nThose advanced demonstrations will allow you, according to your tastes and your technical constraints, to make the right choice for your next modern web project.\n\nThe examples and situations are drawn from more than one year of several projects where we have actually used these tools.\n\nAll codes, and slides are downloadable.","id":3491,"title":"Phantom, Zombie & Karma, overview of the greatest testing tools for modern web app","track":"Web & HTML5","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/450","speaker":"Jean-laurent De morlhon","speakerId":450},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2386","speaker":"Pierre Gayvallet","speakerId":2386}],"type":"University","room":"Room 9"},{"tags":[{"name":"UX"},{"name":"scheduler"},{"name":"social"},{"name":"iOS"},{"name":"android"},{"name":"mobile"}],"summary":"Since a few years we have proudly presented our Devoxx Scheduler apps both for Android and\r\niOS. The development of these apps have been driven by the latest technologies available to\r\nus on these platforms. Each year we try to improve the overall experience.\r\n\r\nIn this session we will give an overview of the different layers behind the visuals, and\r\nhow we have made this from a mere planning tool to an integrated Devoxx experience over\r\nthe years.\r\n\r\nLearn about all the new features: cross-platform syncing, updates triggered through push,\r\na game, geo-fenced voting, social, ...","id":3599,"title":"Planning your week of Rebirth","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1985","speaker":"Michael Seghers","speakerId":1985},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/348","speaker":"Peter Kuterna","speakerId":348}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"gaming"},{"name":"android"},{"name":"mobile"}],"summary":"A quick introduction to Play Games services and some best practices.","id":3729,"title":"Play Games Pronto","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2917","speaker":"Daniel Galpin","speakerId":2917}],"type":"Quickie","room":"Room 4"},{"tags":[{"name":"web"},{"name":"AngularJS"},{"name":"MVX"},{"name":"javascript"},{"name":"JAX-RS"}],"summary":"Have you heard about the MV* hype? Are you curious about really exciting alternatives to traditional java web frameworks? In this session you'll see how to build a basic web application with AngularJS and a Java backend.","id":3691,"title":"Polyglot - Beyond the JVM - Building a Web Application with AngularJS and Java","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2950","speaker":"Nils Preusker","speakerId":2950}],"type":"Quickie","room":"Room 4"},{"tags":[{"name":"REST"},{"name":"event-sourcing"},{"name":"NoSQL"},{"name":"big data"},{"name":"CQRS"}],"summary":"What is data? We want to go back to the essence of data. What is the most pure form of data and how certain architectures like CQRS can help to achieve this pure form. This pure form can be the basis of building other representational models. Data in its pure form can be converted to relational, graph or object models. We call this polyglot modeling. What model is best for inputting data? What model do we use to read data. Using REST in combination with pure data open ups all kinds of integration possibilities. NoSql solutions are perfect for storing data without losing intent. There is a natural fit between CQRS,REST and NoSql-BigData. We should change our way how we think about data and build architecture that use this sort of data as its foundation.","id":3270,"title":"polyglot modeling with pure data","track":"Arch. & Security","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2806","speaker":"Tom Michiels","speakerId":2806}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"javase"},{"name":"adobe"},{"name":"PDF"}],"summary":"Steve Hawley, a veteran of the original Adobe Acrobat team, will discuss the PDF format and how to build a reliable, correct by contract parser and object model using Java reflection and other language features that provide semi-automated parsing, generation and repair of PDF documents.","id":3773,"title":"Practical PDF Parsing in Java: Making Reflection Your Compliant Minion","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3127","speaker":"Steve Hawley","speakerId":3127}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"JPA2"},{"name":"EclipseLink"},{"name":"Glassfish"},{"name":"REST"},{"name":"JSON"},{"name":"JAXB"},{"name":"JAX-RS"},{"name":"HATEOAS"}],"summary":"Java EE developers are increasingly required to embrace thin-server-architecture client application development while leveraging their existing components. On the surface, this appears to simply mean using JAX-RS to expose RESTful services. But the real challenges are often misunderstood and underestimated. EclipseLink has solved a large part of this problem through its new JPA-RS feature which integrates JAX-RS, JAXB and JPA to allow developers to expose their persistent entities over REST with support for all lifecycle operations and query execution. In building JPA-RS, EclipseLink faced and overcame many of the challenges developers face when realizing a REST resource model, addressing HATEOS, and the infrastructure for JSON and XML binding. Learn more in this session.","id":3568,"title":"Practical RESTful Persistence","track":"Java EE","parleysIds":"5148922b0364bc17fc56c9f8","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1005","speaker":"Shaun Smith","speakerId":1005}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"performance"},{"name":"video"},{"name":"audio"},{"name":"technology"}],"summary":"Programmers are the wizards of our age. We weave the fabric of the modern society, tell the stories and bring dreams to life. Geeks are ruling the world of today and programmers make it all happen. The uninitiated marvel at what we accomplish without an inkling about how everything comes to fruition. Many centuries ago, musicians held a similar role in society but today they have lost that grasp on the world. Programmers are in an unprecedented position in which we can not only make a good living, but fuel our work with passion, creativity, collaboration, innovation, and forward thinking. Programmers can make a significant difference in a world that is truly our oyster, and that is worth celebrating.","id":3178,"title":"Programmers are way cooler than musicians","track":"Future<Devoxx>","parleysIds":"514892250364bc17fc56bbed","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2744","speaker":"Geert Bevin","speakerId":2744}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"lombok"},{"name":"compiler"},{"name":"reduceBoilerplate"},{"name":"language"}],"summary":"If there's too much code,\nand it don't look good\nWho you gonna call?\nBoilerplate busters!\n\nIn this presentation, the developers of lombok, Reinier Zwitserloot and Roel Spilker, will show the audience all new lombok features. These features take boilerplate busting to the next level, including call-site extension methods, builders, and enhanced value classes for easy creation of immutable types.\n\nFor those of you that don't know lombok, we'll cover the basics as well: instead of writing out common boilerplate such as getters, setters, toString, equals, and hashCode implementations, you can just use a lombok annotation. Lombok hooks into your compiler and IDE so that their interpretation of your source includes these methods, while you never actually see any of them in your editor. While most IDEs offer a feature to generate the boilerplate, this is little help when reading the resulting code, and such code is much harder to maintain.","id":3528,"title":"Project Lombok: Return of the Boilerplate Busters","track":"Java SE","parleysIds":"514892280364bc17fc56c076","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/342","speaker":"Reinier Zwitserloot","speakerId":342},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/341","speaker":"Roel Spilker","speakerId":341}],"type":"Tools in Action","room":"Room 4"},{"tags":[{"name":"RedHat"},{"name":"APNS"},{"name":"cloud"},{"name":"mobile"},{"name":"GCM"}],"summary":"Mobile, cloud and real-time push enabled applications are having a fundamental impact on the way you design the next generation of your business applications.  In this session, you will see how to quickly build an HTML5 Mobile Hybrid application leveraging jQuery Mobile and Apache Cordova/Phonegap with push notifications via APNS and GCM using free and open source Eclipse-based tooling and leveraging OSS projects such as Aerogear, OpenShift and Vert.x for asynchronous real-time applications. This will be a demonstration heavy session so come prepared.","id":3775,"title":"Push, Mobile & Cloud Oh My!","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3139","speaker":"Burr Sutter","speakerId":3139}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"RaspberryPI"},{"name":"School"},{"name":"Linux"}],"summary":"Windows XP will soon be dead. The old OS should at least go on a well deserved rest, but some small niches still tie it to working life...\n\nMany schools have all their computers still running under Windows XP. As they don’t have enough money to change all their computers, they are forced to survive with the old Windows Xp running on computers scavenged from companies garbages.\n\nA few months ago, while reading some tweets about Raspberry PI, I had a disruptive idea : to replace all the old and sick computers on my childrens school with Raspberry PIs.\n\nThis talk is the tale of the construction of a system to replace all the old computers before septembre 2014. A system based on an customized Edubuntu as server, including internet content filter for children, network and account management, and Raspberry PIs as thin clients,  because vendor solution are too expensive and not fun, and I’m definitely a geek.","id":3363,"title":"Raspberry PI-ing my school","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2804","speaker":"Sébastien Lambour","speakerId":2804},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1388","speaker":"Horacio Gonzalez","speakerId":1388}],"type":"Quickie","room":"Room 3"},{"tags":[{"name":"reactive"},{"name":"FunctionalProgramming"},{"name":"Java8"}],"summary":"Reactive and asynchronous programming is the latest hype for web development.  Why block a thread on a database query when the CPU could be looking at the next one?   While Asynchronous programming can help improve total throughput on a mult-core machine, the current state of the art lacks common patterns for how to define an asynchronous flow.\n\nThat’s all changed with JEP 155 and the new CompletableFuture in JDK8. \n\nThis talk covers the new patterns in asynchronous programming, from joining together a series of asynchronous operations to chaining a pipeline of asynchronous tasks.  We’ll present a few core abstractions from functional programming that help define asynchronous workflow.","id":3400,"title":"Reactive Programming Patterns with Java 8 Futures","track":"Java SE","parleysIds":"51c0c876e4b0d38b54f461f6","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1858","speaker":"Joshua Suereth","speakerId":1858}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"indieDevelopment"},{"name":"android"},{"name":"puzzlers"}],"summary":"It is the corner cases of Android development that can be challenging even for the most experienced programmer. In this interactive session we will present 5 Android puzzles that dive deep into the framework and APIs, providing solutions to real world programming problems that will help you master your next Android project.","id":3551,"title":"Riddle me this, Android Puzzlers","track":"Mobile","parleysIds":"514892280364bc17fc56c0b3","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1081","speaker":"Richard Hyndman","speakerId":1081},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3058","speaker":"Stephan Linzner","speakerId":3058}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"clusters"},{"name":"saphanacloud"},{"name":"PAAS"},{"name":"Java"},{"name":"BigData"},{"name":"cloud"},{"name":"mobile"},{"name":"development"}],"summary":"Come and discuss the present and future of SAP HANA Cloud Platform(https://account.hanatrial.ondemand.com/) with members of the core development team.","id":3664,"title":"SAP HANA Cloud Platform Community BOF","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/236","speaker":"Krasimir Semerdzhiev","speakerId":236},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2870","speaker":"Rui Nogueira","speakerId":2870}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"scala"},{"name":"PlayFramework"},{"name":"FunctionalProgramming"},{"name":"Akka"}],"summary":"The Scala BoF is a space to meet and greet other Scala developers, to learn from each other in an informal chat and to present your Scala project (framework, experiments, application).","id":3409,"title":"Scala Enthusiasts Gathering","track":"JVM Languages","parleysIds":"51704efce4b095cc56d8d4b5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/744","speaker":"Luc Duponcheel","speakerId":744},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1101","speaker":"Renato Cavalcanti","speakerId":1101},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/459","speaker":"Louis Jacomet","speakerId":459}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"scala"}],"summary":"In this session we will look at common misconceptions about Scala implicits, explain why they are not the devil and show how they can be used for different purposes in Scala to greatly improve your code and capabilities.\r\n\r\nTopics covered will include:\r\n\r\n- Implicit conversions (now part of the advanced language features)\r\n- Implicit classes (the new black)\r\n- Implicit AnyVals (blacker than the new black)\r\n- Implicit Parameters for Configuration Passing\r\n- Implicit Type Classes\r\n\r\nJoin us for a deep dive and learn how implicits are your friend, and not the enemy you thought they were.","id":3712,"title":"Scala Implicits, the Real Story","track":"JVM Languages","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/272","speaker":"Dick Wall","speakerId":272},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1858","speaker":"Joshua Suereth","speakerId":1858}],"type":"University","room":"Room 5"},{"tags":[{"name":"security"},{"name":"ZAProxy"},{"name":"OWASP"}],"summary":"Writing secure software is better than plugging holes. A high level of automation is essential for building security into your software development lifecycle. David Tillemans, application security expert at Smals (www.smals.be), will talk about some standard security checks and demonstrate the essential testing tools. Findbugs and PMD are well know open source tools offering great security oriented features. ZAProxy, a web application security scanner developed by OWASP (Open Web Application Security Project), is great for testing the security issues of the  web frontend. It can be integrated in your test driven development lifecycle.  The session will demonstrate the integration of ZAproxy into Maven using a plugin and how to perform automatic web security scans based on your Selenium tests.","id":3771,"title":"Security test automation in software development using open source tools","track":"Arch. & Security","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3121","speaker":"David Tillemans","speakerId":3121}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"End-to-Endtesting"},{"name":"android"},{"name":"Selenium"}],"summary":"Selendroid is an open source test automation framework which drives of the UI of Android native and hybrid applications (apps). Tests are written using the Selenium 2 client API and for testing the application under test must not be modified.\nThis presentation demonstrates to the audience the challenges we face at eBay europe about mobile test automation of our Android apps. It shows based on real examples about how selendroid can be used to test native and hybrid Android apps, how the Selenium Grid can be used for parallel testing on multiple devices (emulators and hardware devices) and how cross platform test (between Android, web and iOS) can be written.","id":3537,"title":"Selendroid - Selenium for Android Apps","track":"Mobile","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2918","speaker":"Dominik Dary","speakerId":2918}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"google"},{"name":"AngularJS"},{"name":"web3"}],"summary":"Shaping the future of web development, Google keynote on Thursday morning.","id":3725,"title":"Shaping the future of web development","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3040","speaker":"Lars Bak","speakerId":3040}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"Mahout"},{"name":"Hadoop"},{"name":"BigData"}],"summary":"Recommendation engines are generally built such that a single kind of user interaction with a single kind of item is used to suggest the same kind of interaction with the same kind of item. In practice however, this approach is flawed for several reasons. First, multiple kinds of interactions with multiple kinds of items are typically available and should be used. Second, recommendation is better viewed as a ranking problem rather than a regression problem. Finally, practical recommendation systems should be constantly self-training as today’s recommendations and selections can be used to train tomorrow’s recommender.\r\n\r\nThis session will describe a practical recommendation architecture and implementation style that addresses all of the above issues and which is considerably easier to implement and deploy than conventional approaches. Several of the techniques that I will describe have never (to my knowledge) appeared in the research literature.","id":3751,"title":"Simple Deployment of Recommendation Engines","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2657","speaker":"Ted Dunning","speakerId":2657}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"HTML5"},{"name":"javascript"},{"name":"websockets"},{"name":"Knockout.js"}],"summary":"Knockout.js provides a simplistic library for binding events to your HTML5 application.   When combined with Play frameworks simple websocket and Server-Sent-Event support, the combination becomes very powerful.\n\nThis talk will cover the basics of using Knockout.js with a focus on reacting to events sent over a stream from the web server.  We'll be building a Tic-Tac-Toe game, covering the fundamentals of:\n\n* Basic template design with Knockout\n* Mapping data from the server into observables\n* Responding to Ui events\n* Handling an event stream","id":3402,"title":"Single Page Apps with Knockout.js and Play Framework","track":"Web & HTML5","parleysIds":"51c1a652e4b0ed877035681f","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2909","speaker":"Maxime Dantec","speakerId":2909},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1858","speaker":"Joshua Suereth","speakerId":1858}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"javaee"},{"name":"Testing"},{"name":"web"},{"name":"JMS"},{"name":"JPA"},{"name":"Java8"},{"name":"spring"}],"summary":"Spring Framework 4.0 is the next generation of the popular open source framework for Enterprise Java developers, focusing on the future with support for Java SE 8 & Java EE 7. In this presentation core Spring committer Sam Brannen will provide attendees an overview of the new enterprise features in the framework as well as new programming models made possible with the adoption of JDK 8 language features & APIs.\n\nSpecifically, this talk will cover support for lambda expressions & method references against Spring callback interfaces, JSR-310 Date-Time value types for Spring data binding & formatting, Spring's new @Conditional mechanism for activation of bean definitions, & a new WebSocket endpoint model. Regarding enterprise APIs, the presentation covers Spring 4.0's new support for JMS 2.0, JPA 2.1, Bean Validation 1.1, Servlet 3.1, JCache, & JSR-236 concurrency. Last but not least, Sam will discuss improvements to Spring's testing support & point out deprecations in the framework.","id":3235,"title":"Spring Framework 4.0 - The Next Generation","track":"Java EE","parleysIds":"51b4c7c9e4b01033a7e4b720","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2788","speaker":"Sam Brannen","speakerId":2788}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"CMS"},{"name":"osgi"},{"name":"spring"}],"summary":"Every good webapp needs a UI and while your business users are painful, they still want to control the look and feel of any customer facing system.  Learn how to use dotcms (a Java Content Management System) to deploy content managed Spring web apps on running websites via osgi.  dotcms provides developers a way to hot swap classes and Spring controllers, to integrate content and even to push publish complete web apps between separate CMS instances or installations.","id":3776,"title":"Spring Webapps + OSGi + dotcms = profit!","track":"Java EE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3167","speaker":"Will Ezell","speakerId":3167}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"javase"},{"name":"quadcopter"},{"name":"robotics"},{"name":"Drones"}],"summary":"Drones with attached sensors are the high-tech eyes of a modern farmer. Flying above the crop, they measure stress and growth. Tractors have become precision instruments and require detailed growth maps to be optimally utilized. How to put all this high tech to good use? Java plays a key role in connecting all these devices and furnishing sensible information to farmers. This session provides insight into how Java is used to evolve tech toys into precision agriculture instruments.","id":3761,"title":"Taming Drones: How Java Controls the Uprising of the Drone Force","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3112","speaker":"Eva Veenstra-kazakov","speakerId":3112},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1986","speaker":"Timon Veenstra","speakerId":1986}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"Testing"},{"name":"web"},{"name":"functional-testing"},{"name":"groovy"}],"summary":"Functional Web Testing - everyone wants it, (almost) everyone struggles with it. In this talk, we will demonstrate how to tame the beast with <a href=\"http://spockframework.org\">Spock<\/a> and <a href=\"http://gebish.org\">Geb<\/a>, two popular testing tools from the Groovy/Java world. The goal is to arrive at readable, executable and maintainable specifications that still make sense the day after they have been written. Join in and judge for yourself!","id":3680,"title":"Taming Functional Web Testing (with Spock & Geb)","track":"Web & HTML5","parleysIds":"514892290364bc17fc56c57f","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2519","speaker":"Luke Daley","speakerId":2519},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/199","speaker":"Peter Niederwieser","speakerId":199}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"education"},{"name":"RaspberryPI"}],"summary":"In the UK the school education system is experiencing radical reform. This is particularly the case with computing. There’s momentum to separate ICT from Computer Science and to place specific emphasis on the teaching of Computational Thinking. In broad terms, we shouldn’t just be teaching our children office skills such as formatting Word documents – we should be teaching them how to code and create their own software. This talk introduces Sonic Pi, a music language and environment running on the Raspberry Pi specifically focussed on introducing core Computer Science concepts within schools. Sonic Pi emphasises the importance of creativity in pedagogic contexts enabling learners to exhibit self-agency through the application of the taught ideas in musical works they create and own.","id":3724,"title":"Teaching Computer Science with Music","track":"Future<Devoxx>","parleysIds":"516bf3d3e4b05b6ad71fa758","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3059","speaker":"Sam Aaron","speakerId":3059}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"Myo"},{"name":"innovation"},{"name":"wearable"}],"summary":"Thalmic Labs is the company behind Myo, the wearable gesture control armband that senses the movements of the muscles of the forearm to control digital devices.  We will be talking about the development of the Myo API. From it's inspirations, origin's and creation to how we have used it and our thoughts on where it can be taken.","id":3731,"title":"Thalmic Labs - Myo API from init to flush","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3053","speaker":"Gord Tanner","speakerId":3053},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3077","speaker":"Scott Greenberg","speakerId":3077}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"DevOps"},{"name":"MongoDB"},{"name":"technology"},{"name":"groovy"}],"summary":"Enterprise Java developers value reliability and stability, but what happens to your technology stack if you’re willing to take a risk?  At jClarity we’re running production systems using Html 5, Angular.js, vertx, Mongo, groovy and deploying using chef.  Its been an interesting ride: some things worked really well and some things don’t.\n\nCome along and find out what we’d recommend and what we’d avoid with hindsight.  We’ll also talk about how we ended up with such a diverse stack and how to make technology choices in a fairer way.  We’ve made the mistakes so you don’t have to.","id":3223,"title":"The Bleeding Edge","track":"Java SE","parleysIds":"517fb1c9e4b0c2a859eb9ecb","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/405","speaker":"Martijn Verburg","speakerId":405},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1848","speaker":"Richard Warburton","speakerId":1848}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"javase"},{"name":"robotics"},{"name":"RaspberryPI"},{"name":"javame"}],"summary":"In this session you will learn the behind-the-scenes secrets of the Raspberry Pi powered Chess Demo.  This includes insight into how the chess pieces were moulded and the active chess board was fabricated, hardware design of the robotic arm including challenges with accuracy and calibration, and the state-of-the art in Java SE and Java ME embedded implementations.","id":3757,"title":"The Chess Game","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3108","speaker":"Collins Gary","speakerId":3108},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3107","speaker":"Alexander Kouznetsov","speakerId":3107}],"type":"BOF","room":"BOF 1"},{"tags":[{"name":"quadcopter"},{"name":"innovation"},{"name":"robotics"}],"summary":"As technology enthusiast we have often dreamt about having a flying robot to program and experiment with. The Crazyflie Nano Quadcopter is our attempt to make this dream a reality.\r\nThe development we started back in 2009 eventually lead to a open source palm­sized quadcopter development platform. The platform gives enthusiasts and developers a flying base on which to experiment on, hack or just fly for fun.\r\nAfter years of late night development during our spare time we are really excited to see users flying the Crazyflie all over the world. Thanks to an active community worldwide we have gotten to see our quadcopter do things that we could never have done, or even imagined when we started out.\r\nWe will present part of our development journey, explain some of the technology behind our quadcopter and what the biggest challenges were. We will also show you some of the hacks and projects that we and the community have done over the years as well as give a flight demo.","id":3730,"title":"The Crazyflie Nano Quadcopter development platform","track":"Future<Devoxx>","parleysIds":"5148922b0364bc17fc56c922","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3076","speaker":"Tobias Antonsson","speakerId":3076},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3075","speaker":"Arnaud Taffanel","speakerId":3075},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3034","speaker":"Marcus Eliasson","speakerId":3034}],"type":"Conference","room":"Room 7"},{"tags":[{"name":"javascript"},{"name":"JVM"},{"name":"nashorn"}],"summary":"Implementing a programming language atop of Java platform brings up some curious integration challenges with it. In the process of designing Nashorn’s Java platform integration features, we had to figure out lots of things: How can you subclass Java classes in script? What interfaces should script objects expose to Java: map, list, both, none? What consequences do the different decisions bring? How to reconcile differences in array representation? What’s a correct JSON representation of a POJO? Should Java packages exist as objects? How much plumbing should we hide as a convenience to developers, and what should remain exposed lest they stumble across it in the dark? How does Java security model affect the design? We'll answer all these questions in this presentation.","id":3732,"title":"The Curious Case of JavaScript on the JVM","track":"JVM Languages","parleysIds":"51afc0e7e4b01033a7e4b6e9","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2651","speaker":"Attila Szegedi","speakerId":2651}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"Testing"},{"name":"CI"},{"name":"iOS"},{"name":"android"}],"summary":"Continuously testing your applications is important to maintain the quality and to make sure problems don’t occur after making changes to the applications. \nThere are various frameworks out in the open that can help you create functional tests for your mobile applications. With many of these frameworks you need to have technical knowledge to create your functional tests. \nAn exception to this rule is Calabash. This framework allows both technical and a-technical people to elegantly create functional tests for Android and iOS using natural language. Ali will be talking about Calabash and how easy it will become to create functional tests once entering the world of Calabash.","id":3163,"title":"The elegance of functional testing using Calabash","track":"Mobile","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2287","speaker":"Ali Derbane","speakerId":2287}],"type":"Tools in Action","room":"Room 5"},{"tags":[{"name":"BoF"},{"name":"groovy"},{"name":"language"}],"summary":"Come and talk with the actors of the Groovy ecosystem: language implementors, framework authors, etc.\r\n\r\nWe'll talk about all things Groovy, what's in store for Groovy, Grails, Gradle, etc.\r\n\r\nAnd we'll be happy to discuss with you and gather your feedback of where you'd love those project to be heading.","id":3589,"title":"The Groovy ecosystem BOF","track":"JVM Languages","parleysIds":"5148922b0364bc17fc56ca24","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/958","speaker":"Hans Dockter","speakerId":958},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/6","speaker":"Guillaume Laforge","speakerId":6},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/5","speaker":"Andres Almiray","speakerId":5},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/163","speaker":"Dierk König","speakerId":163}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"DevOps"},{"name":"SoftwareCraftsmanship"},{"name":"agile"}],"summary":"Most software development teams deliver applications over time, over budget and with a distinct lack of quality. However, some organisations and teams are orders of magnitude better, allowing their business to scale and be flexible in a rapidly changing world.\n\nSo how do you transform your organisation and teams from a cost center into part of your revenue generating business? How do you get your IT and software development teams to work at their creative best? How do you create those magic \"x10\" teams that the tech media keeps talking about?\n\nOver the past 12 years Martijn Verburg (aka The Diabolical Developer) has specialised in transforming technical teams. From deep tech start-ups through to ponderous government departments, he'll cover the cultural and technical habits of the highly effective teams.\n\nHe's going to unveil the truth, and also tell you what not to do from bitter first, second and third hand experience.","id":3214,"title":"The Habits of Highly Effective Technical Teams","track":"Methodology","parleysIds":"5148922a0364bc17fc56c7e4","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/405","speaker":"Martijn Verburg","speakerId":405}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"javase"},{"name":"scala"},{"name":"modules"},{"name":"Methodology"},{"name":"Ceylon"}],"summary":"I think most of us will agree that modularity is a Good Thing. However, while it is possible to create nice modular applications, current languages do not offer a lot of tools that would make this task easier. Hence we'll start by creating a (subjective) list of requirements for an \"ideal\" module system, just to know how much more work is needed.\n\nThen we will take a look at Java packages. We usually think about packages in a hierarchical way, yet they are treated by tools as simple identifiers. We use them for scoping, but Java only supports package-private scope. We could use them as a module system, but we create build modules instead.\n\nI'd like to show two approaches to solving this problem. One is Veripacks, a Java/Scala library which verifies transitive module-related annotations. Second is the module system in Ceylon, where modularity is one of the main features of the language. I'll also compare with OSGi, and show how it differs.","id":3126,"title":"The ideal module system and the harsh reality","track":"Methodology","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/95","speaker":"Adam Warski","speakerId":95}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"Testing"},{"name":"web"},{"name":"jenkins"},{"name":"javascript"}],"summary":"You are developing Java applications for years now, and you are used to have a very complete and powerful software factory: Git(Hub), Jenkins, Sonar, you practice TDD, BDD, etc..\nBut now your JavaScript codebase grows constantly, and you are wondering how to make your developments faster, safer, stronger, with a good software factory and well-chosen tools dedicated to JavaScript.\nSo, how to industrialize your JavaScript developments?\n\nDuring this Quickie, we will make a tour of all the important components for your Software Factory, explaining how you can reuse your current tools, and also by introducing new elements such as Yeoman.","id":3545,"title":"The ingredients for a perfect JavaScript Software Factory","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1406","speaker":"Romain Linsolas","speakerId":1406}],"type":"Quickie","room":"Room 3"},{"tags":[{"name":"javame"},{"name":"IoT"},{"name":"m2m"}],"summary":"The applications technology landscape surrounding the Internet of Things (IoT), also called machine-to-machine (M2M) communications, is a Wild West environment full of proprietary technology implementations and a highly fragmented vendor ecosystem. To address the ever-growing IoT environment, Java offers developers a standards-based platform to enable highly integrated end-to-end solutions. This session outlines some of the key issues developers face today in developing, scaling, and extending end-to-end M2M solutions. With the help of sample reference use cases, attendees will learn of the benefits of using Java Embedded to address both the challenges and opportunities in IoT.","id":3753,"title":"The Internet of Things with Java","track":"Future<Devoxx>","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1666","speaker":"Sharat Chander","speakerId":1666}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"HTML5"},{"name":"jQuery"},{"name":"CSS3"},{"name":"AngularJS"},{"name":"javascript"},{"name":"mobile"}],"summary":"HTML5, CSS3, JavaScript, jQuery, Angular JS, Bootstrap, Mobile, CoffeeScript, GitHub, functional programming, Page Speed, Apache, JSON with Jackson, caching, REST, Security, load testing, profiling, Wro4j, Heroku, Cloudbees, AWS. \n\nThese are just some of the buzzwords that a Java web developer hears on a daily basis. This talk is designed to expose you to a plethora of technologies that you might've heard about, but haven't learned yet. We'll concentrate on the most important web developer skills, as well as UI tips and tricks to make you a better front-end engineer. Some of the most valuable engineers these days have front-end JS/CSS skills, as well as backend Java skills.","id":3648,"title":"The Modern Java Web Developer","track":"Web & HTML5","parleysIds":"51b27df5e4b0065193d63016","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/20","speaker":"Matt Raible","speakerId":20}],"type":"University","room":"Room 8"},{"tags":[{"name":"modules"},{"name":"jigsaw"},{"name":"JavaSE9"}],"summary":"Project Jigsaw aims to create a simple, friendly, and scalable standard module system for the Java platform. This session explains its key goals and design principles, shows the progress made in the past year, and demonstrates its use.","id":3735,"title":"The Modular Java Platform and Project Jigsaw","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/279","speaker":"Mark Reinhold","speakerId":279}],"type":"Conference","room":"Room 8"},{"tags":[{"name":"javafx"},{"name":"javascript"},{"name":"RaspberryPI"}],"summary":"In this Quickie an example will be shown about how to use JavaScript to script a JavaFX application on the Raspberry Pi by using Nashorn which is the new JavaScript runtime engine that will come with JDK8. When developing for the Raspberry Pi you most of the times code on your desktop, create an executable jar file, copy it to the Pi and start it there. In the case of modification you have to modify the code on the desktop, create the jar and copy it to the Pi again. To improve this workflow Nashorn comes in very handy because it let you script your application during runtime by executing JavaScript files.","id":3177,"title":"The Nashorn, the Pi and some JavaFX","track":"Future<Devoxx>","parleysIds":"5148922b0364bc17fc56c896","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/394","speaker":"Gerrit Grunwald","speakerId":394}],"type":"Quickie","room":"Room 8"},{"tags":[{"name":"REST"},{"name":"Hadoop"},{"name":"CloudFoundry"},{"name":"spring-XD"},{"name":"HATEOAS"},{"name":"spring"},{"name":"spring-batch"},{"name":"SpringMVC"}],"summary":"Spring 4.0 is upon us, along with Spring XD, a whole slew of new Java configuration-powered APIs, a Batch JSR implementation, incredible improvements in the Spring Data space, along with the most complete support for REST in the industry. A lot has happened or emerged in the last year in the Spring world. Let's talk about it - bring your questions and let's look at where Spring is, and where it's going, together.","id":3387,"title":"The Spring BOF","track":"Java SE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/921","speaker":"Josh Long","speakerId":921}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"Java"},{"name":"JVM"},{"name":"Kotlin"},{"name":"puzzlers"}],"summary":"Kotlin is a statically-typed JVM-targeted programming language developed by JetBrains. One of its major goals is to provide developers with safer and more concise language than Java while keeping simple enough for industrial use.\n\nSo far, so good. But can we somehow assess these qualities?    \n\nFamous \"Java Puzzlers\" series of talks (as well as the book) made it clear that there are quite a few cases when Java programs display counterintuitive or just obscure behavior. While some are JVM-related, most of those cases have roots in Java language design. Now, we tried to translate the puzzlers to Kotlin and compare them with the originals.\n\nIn this talk we're going to tell the story of Java puzzlers from the Kotlin perspective which would demonstrate how Kotlin design helps to eliminate some problematic issues found in Java. In particular, we'd consider such aspects as expressions and control structures, exception handling, object and classes, nullable types and extentions.","id":3575,"title":"The Unpuzzling Kotlin: Bringing Clarity to Your Code","track":"JVM Languages","parleysIds":"5148922b0364bc17fc56c94d","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2926","speaker":"Svetlana Isakova","speakerId":2926},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2768","speaker":"Aleksei Sedunov","speakerId":2768}],"type":"Conference","room":"Room 6"},{"tags":[{"name":"scala"},{"name":"FunctionalProgramming"},{"name":"groovy"}],"summary":"Functional Programming has been around for a while, but it is gaining popularity, especially due to direct support in languages on the JVM. Writing code in functional style is not about syntax. It is a paradigm shift. In this presentation, using examples from Java, Groovy, and Scala, you will learn how to write code in functional style. We will start out discussing the elements of functional programming and then look at examples of some common operations and how you can implement those in functional style.\r\n\r\nThen we will explore the functional style of programming in Groovy.  Groovy is not a functional programming language, writing in functional style is common and idiomatic in Groovy. While you have used these features in Groovy, learning the tenets of functional programming will help you recognize these and make better use of them in the future.","id":3743,"title":"Thinking Functional Style","track":"JVM Languages","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3043","speaker":"Venkat Subramaniam","speakerId":3043}],"type":"University","room":"Room 9"},{"tags":[{"name":"scala"},{"name":"best-practice"},{"name":"PlayFramework"}],"summary":"The Play! framework makes web development a pleasure by providing type-safe ways of building applications, catching many possible mistakes upfront at compilation time rather than at runtime.\n\nAs a Play application grows in size, however, the configuration for building and structuring a project may require some tuning in order to keep the development lifecycle fast and productive.\n\nAdditionally there is a number of tools and libraries that can support individual developers and teams to stay productive: code formatting with scalariform, style checking with scalastyle, front-end testing Selenium and Chrome (also on Jenkins), BDD with Cucumber, etc.\n\nThis quickie will quickly go over a number of these techniques and tools, and pragmatically show how to configure them.","id":3577,"title":"Tips and tricks for setting up a Play 2 project","track":"Web & HTML5","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/485","speaker":"Manuel Bernhardt","speakerId":485}],"type":"Quickie","room":"Room 3"},{"tags":[{"name":"userinterface"},{"name":"engineering"},{"name":"Architecture"},{"name":"code-usability"}],"summary":"\"Do the maximum, not matter what it costs or how long it takes\" -\nthat's what we never hear. UI engineering enables us to reach the best possible UI under given constraints.\nEvery application is only as good as its weakest link. But while much thought and effort is spent to engineer the backend, the frontend is generally judged only by the visual appearance without paying much attention to solid and sustainable internals.\nWe will go through the fallacies that lead to this situation, explain why this is inefficient, suggest improvements, and picture a better future. \nAll this comes with practical examples, anecdotes from the field, and considerations about design, usability, and the constraints under which UIs are developed.\nWe will end with a call to action where UI engineers shall form a community to advance their profession.\nEverybody who is remotely interested in user interfaces, usability, and first-class applications will enjoy the show.","id":3563,"title":"UI Engineer - the missing profession","track":"Methodology","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/163","speaker":"Dierk König","speakerId":163}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"HTML5"},{"name":"Testing"},{"name":"automation"},{"name":"javascript"}],"summary":"Karma (formerly known as Testacular) is a test runner that makes unit testing of client-side code fun!\n\nDesigned from ground up with the best possible workflow in mind, Karma is now one of the most popular test runners out there and has become the testing tool of choice for the AngularJS community and beyond.\n\nhttp://karma-runner.github.io/","id":3663,"title":"Unit testing JavaScript/CoffeeScript/Dart code with Karma","track":"Web & HTML5","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3177","speaker":"Brian Ford","speakerId":3177}],"type":"Tools in Action","room":"Room 8"},{"tags":[{"name":"DevOps"},{"name":"Methodology"},{"name":"technology"},{"name":"agile"},{"name":"Design"}],"summary":"Today we are in the age of apps, for almost every platform there exists an app-store. Users are 1 click away from millions of applications, this means that your app has 1 chance in a million to get selected. So when your app got noticed and installed by somebody you have very little time to convince them they installed the right app. The user-experience and usability of the app is therefore very crucial. Today's analytics tools can be used to understand how people use the application but it doesn't tell you anything why users are doing it that way! Techniques and methods from the User-Experience domain should be combined with this analytics data to better understand it. During this session we'll show participants how they could use an online service like UXprobe to combine analytics with surveys and likability feedback to improve the apps they build.","id":3132,"title":"User-Experience Metrics for Apps","track":"Methodology","parleysIds":"514892290364bc17fc56c51e","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2706","speaker":"Jan Moons","speakerId":2706}],"type":"Tools in Action","room":"Room 8"},{"tags":[{"name":"javamesdk"},{"name":"embeddedjava"},{"name":"javame"},{"name":"internetofthings"},{"name":"m2m"}],"summary":"This session will demonstrate how to build and deploy Java ME embedded applications using the Java ME SDK. Will demonstrate on device deployment, profiling and debugging of application using a ARM based Keil evaluation board mcbstm32f200, Raspberry Pi and the built in ME SDK device emulator.","id":3286,"title":"Using the Java ME SDK to build real world embedded applications","track":"Future<Devoxx>","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2314","speaker":"Robert Clark","speakerId":2314}],"type":"Tools in Action","room":"Room 5"},{"tags":[{"name":"web"},{"name":"javascript"},{"name":"webjars"}],"summary":"This introduction to WebJars will explain the reasons for managing JavaScript and CSS assets like traditional dependencies.  Attendees will learn how to get started using WebJars and integrate them with RequireJS.","id":3407,"title":"WebJars - The Web in JARs","track":"Web & HTML5","parleysIds":"51b4f950e4b01033a7e4b728","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2871","speaker":"James Ward","speakerId":2871}],"type":"Quickie","room":"Room 8"},{"tags":[{"name":"AngularJS"},{"name":"javascript"},{"name":"Angular"}],"summary":"Look behind the scenes of what we are thinking about for the next big version of Angular. Here are some hints:  Hierarchical injection; Async injectors; Object.observe(); Hybrid world through web-components  (all frameworks play nice together);  JavaScript annotations;\n Better Directive API (composition of directives); How do things work: DI, Dirty Checking, Compiler","id":3468,"title":"What is in store for the future of Angular","track":"Web & HTML5","parleysIds":"5148922b0364bc17fc56c91b","experience":"EXPERT","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1949","speaker":"Igor Minar","speakerId":1949},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2059","speaker":"Misko Hevery","speakerId":2059}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"JEE"},{"name":"invokedynamic"},{"name":"JVM"}],"summary":"While the Java EE spec is quite modular, the current implementation (JBoss AS, Spring, Glassfish, etc) of the spec are quite monolithic and it's not that easy to compose parts of one implementations with parts of another one.\r\n\r\nI will present how most popular Java EE implementation works under the hood, what are the Java techniques and tricks used by those implementations and how this can be abstracted to a set of common operations.\r\n\r\nThen I will explain how the tools used by the dynamic language runtimes written on top of the JVM introduced in Java 7 can be re-purposed to be used to implement the backbone of any Java EE implementation in order to make it each of its parts composable.","id":3614,"title":"What Java EE can learn from dynamic languages?","track":"Java EE","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1479","speaker":"Remi Forax","speakerId":1479},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3442","speaker":"Jérôme Pilliet","speakerId":3442}],"type":"Conference","room":"Room 9"},{"tags":[{"name":"productivity"},{"name":"groovy"},{"name":"language"}],"summary":"Groovy is not a newcommer in the arena of alternative languages for the JVM.\nBut with over 1.7 million downloads a year, it's clearly ahead of the pack.\n\nAnd what makes it a great choice for your projects?\n- a flat learning curve for Java developers\n- its seemless Java integration where you can mix & mash Groovy & Java together\n- a maleable & concise syntax fit for Domain-Specific Languages\n- an interesting take on type safety\n- its rich ecosystem of projects: Grails, Gradle, GPars, Spock, Griffon, Geb...\n\nIn this session, we'll see how this all fits together in the big Groovy picture, when and where you can use Groovy, and how you can take advantage of Groovy for boosting your productivity!","id":3585,"title":"What Makes Groovy Groovy","track":"JVM Languages","parleysIds":"5148922b0364bc17fc56ca24","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/6","speaker":"Guillaume Laforge","speakerId":6}],"type":"Conference","room":"Room 4"},{"tags":[{"name":"graphics"},{"name":"android"},{"name":"mobile"}],"summary":"Engineers from the Android team at Google will give at overview of the latest developer features of the Android platform.","id":3191,"title":"What's New in Android","track":"Mobile","parleysIds":"5148922b0364bc17fc56ca1c","experience":"SENIOR","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/132","speaker":"Romain Guy","speakerId":132},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/129","speaker":"Chet Haase","speakerId":129}],"type":"Conference","room":"Room 5"},{"tags":[{"name":"HTML5"},{"name":"javafx"},{"name":"OpenJFX"}],"summary":"JavaFX 8 contains many new and exciting features for JavaFX developers, including enhancements to WebView’s HTML5 support , 3-D, the ability to embed Swing nodes inside a JavaFX Scene Graph, new UI controls, a new visual theme, and much more. JavaFX has also been ported to a variety of new embedded platforms. In this session an overview of the new functionality in JavaFX 8 and OpenJFX will be given, and JavaFX 8 development, including Lambda features, will be demonstrated on a Raspberry Pi.","id":3741,"title":"What's New in JavaFX 8","track":"Java SE","parleysIds":"5148922b0364bc17fc56c941","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/1543","speaker":"Jim Weaver","speakerId":1543},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/98","speaker":"Stephen Chin","speakerId":98},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3488","speaker":"Michael Hoffer","speakerId":3488}],"type":"University","room":"Room 4"},{"tags":[{"name":"javase"},{"name":"Windows"},{"name":"cloud"}],"summary":"Explore your new choices in working with Java and Windows. Here a personal account of how Microsoft is working with friends including Oracle, Azul System and the Eclipse community, to realize rainbows and unicorns in white clouds with Java. You’re also invited to join the bliss with simple tips and tricks to work with Java and Windows. The cloud continues to bring change with an increasing demand to make the mixed up world of IT work better together. The old black or white debate around open source software is simply no longer relevant. Open cloud platforms and a demand for cross-platform developer tools have created new industry alliances. Come see the unicorn!","id":3756,"title":"White clouds, rainbows and unicorns: Java and Windows","track":"Cloud & BigData","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/3106","speaker":"Gianugo Rabellino","speakerId":3106}],"type":"Conference","room":"Room 3"},{"tags":[{"name":"OpenSourceSoftware"},{"name":"javaee"},{"name":"jboss"}],"summary":"JBoss AS is now called WildFly and it is even faster!\r\n\r\nCome to discuss (over beer) the present and future of the WildFly community project with distinguished members of the JBoss Core Development Team!","id":3473,"title":"WildFly Application Server - Community BOF","track":"Java EE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/999","speaker":"Dimitris Andreadis","speakerId":999}],"type":"BOF","room":"BOF 2"},{"tags":[{"name":"JVM"},{"name":"DSL"},{"name":"Livecoding"},{"name":"android"}],"summary":"Xtend is a flexible and expressive dialect of Java. It compiles to idiomatic source code that can be compiled and run an any JVM since Java5. Without any gap, you can use all you favorite Java libraries. The compiled Java source code is readable and pretty printed, runs as fast as handwritten code and can be processed by existing tools like annotation processors or static code analyzers.\r\n\r\nIf you want to become more productive and write beautiful code with powerful macros, lambdas, and many more modern language features, Xtend is the right choice. In this code centric session, you'll see it in action with real world examples using JavaFX, Android and other exciting frameworks.","id":3202,"title":"Xtend in Action","track":"JVM Languages","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/782","speaker":"Sven Efftinge","speakerId":782},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/2764","speaker":"Sebastian Zarnekow","speakerId":2764}],"type":"Tools in Action","room":"Room 4"},{"tags":[{"name":"spring-XD"},{"name":"spring"},{"name":"groovy"}],"summary":"Are you an impatient programmer who wishes the keyboard could keep up with you? If you've ever wished Java and Spring could do more to keep up, then this is the place to be. We present Spring Boot, a toolkit and runtime platform that will get you up and running with Spring-powered, production-grade applications and services faster than you believed possible. We will start the training with a few basics about Spring depending on audience experience and then move into sharing the goals of Spring Boot.","id":3749,"title":"Zero Effort Spring","track":"Java EE","experience":"NOVICE","language":"en","speakers":[{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/59","speaker":"Dave Syer","speakerId":59},{"speakerUri":"http://cfp.devoxx.com/rest/v1/events/speakers/921","speaker":"Josh Long","speakerId":921}],"type":"University","room":"Room 4"}]